bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
// Copyright (c) 2009 Rowley Associates Limited.
//
// This file may be distributed under the terms of the License Agreement
// provided with this software.
//
// THIS FILE IS PROVIDED AS IS WITH NO WARRANTY OF ANY KIND, INCLUDING THE
// WARRANTY OF DESIGN, MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE.

#ifndef LPC2368_h
#define LPC2368_h

#define FIO_BASE 0x3FFFC000

#define FIO0DIR (*(volatile unsigned long *)0x3FFFC000)
#define FIO0DIR_OFFSET 0x0

#define FIO0DIR0 (*(volatile unsigned char *)0x3FFFC000)
#define FIO0DIR0_OFFSET 0x0

#define FIO0DIR1 (*(volatile unsigned char *)0x3FFFC001)
#define FIO0DIR1_OFFSET 0x1

#define FIO0DIR2 (*(volatile unsigned char *)0x3FFFC002)
#define FIO0DIR2_OFFSET 0x2

#define FIO0DIR3 (*(volatile unsigned char *)0x3FFFC003)
#define FIO0DIR3_OFFSET 0x3

#define FIO0DIRL (*(volatile unsigned short *)0x3FFFC000)
#define FIO0DIRL_OFFSET 0x0

#define FIO0DIRH (*(volatile unsigned short *)0x3FFFC002)
#define FIO0DIRH_OFFSET 0x2

#define FIO0MASK (*(volatile unsigned long *)0x3FFFC010)
#define FIO0MASK_OFFSET 0x10

#define FIO0MASK0 (*(volatile unsigned char *)0x3FFFC010)
#define FIO0MASK0_OFFSET 0x10

#define FIO0MASK1 (*(volatile unsigned char *)0x3FFFC011)
#define FIO0MASK1_OFFSET 0x11

#define FIO0MASK2 (*(volatile unsigned char *)0x3FFFC012)
#define FIO0MASK2_OFFSET 0x12

#define FIO0MASK3 (*(volatile unsigned char *)0x3FFFC013)
#define FIO0MASK3_OFFSET 0x13

#define FIO0MASKL (*(volatile unsigned short *)0x3FFFC010)
#define FIO0MASKL_OFFSET 0x10

#define FIO0MASKH (*(volatile unsigned short *)0x3FFFC012)
#define FIO0MASKH_OFFSET 0x12

#define FIO0PIN (*(volatile unsigned long *)0x3FFFC014)
#define FIO0PIN_OFFSET 0x14

#define FIO0PIN0 (*(volatile unsigned char *)0x3FFFC014)
#define FIO0PIN0_OFFSET 0x14

#define FIO0PIN1 (*(volatile unsigned char *)0x3FFFC015)
#define FIO0PIN1_OFFSET 0x15

#define FIO0PIN2 (*(volatile unsigned char *)0x3FFFC016)
#define FIO0PIN2_OFFSET 0x16

#define FIO0PIN3 (*(volatile unsigned char *)0x3FFFC017)
#define FIO0PIN3_OFFSET 0x17

#define FIO0PINL (*(volatile unsigned short *)0x3FFFC014)
#define FIO0PINL_OFFSET 0x14

#define FIO0PINH (*(volatile unsigned short *)0x3FFFC016)
#define FIO0PINH_OFFSET 0x16

#define FIO0SET (*(volatile unsigned long *)0x3FFFC018)
#define FIO0SET_OFFSET 0x18

#define FIO0SET0 (*(volatile unsigned char *)0x3FFFC018)
#define FIO0SET0_OFFSET 0x18

#define FIO0SET1 (*(volatile unsigned char *)0x3FFFC019)
#define FIO0SET1_OFFSET 0x19

#define FIO0SET2 (*(volatile unsigned char *)0x3FFFC01A)
#define FIO0SET2_OFFSET 0x1A

#define FIO0SET3 (*(volatile unsigned char *)0x3FFFC01B)
#define FIO0SET3_OFFSET 0x1B

#define FIO0SETL (*(volatile unsigned short *)0x3FFFC018)
#define FIO0SETL_OFFSET 0x18

#define FIO0SETH (*(volatile unsigned short *)0x3FFFC01A)
#define FIO0SETH_OFFSET 0x1A

#define FIO0CLR (*(volatile unsigned long *)0x3FFFC01C)
#define FIO0CLR_OFFSET 0x1C

#define FIO0CLR0 (*(volatile unsigned char *)0x3FFFC01C)
#define FIO0CLR0_OFFSET 0x1C

#define FIO0CLR1 (*(volatile unsigned char *)0x3FFFC01D)
#define FIO0CLR1_OFFSET 0x1D

#define FIO0CLR2 (*(volatile unsigned char *)0x3FFFC01E)
#define FIO0CLR2_OFFSET 0x1E

#define FIO0CLR3 (*(volatile unsigned char *)0x3FFFC01F)
#define FIO0CLR3_OFFSET 0x1F

#define FIO0CLRL (*(volatile unsigned short *)0x3FFFC01C)
#define FIO0CLRL_OFFSET 0x1C

#define FIO0CLRH (*(volatile unsigned short *)0x3FFFC01E)
#define FIO0CLRH_OFFSET 0x1E

#define FIO1DIR (*(volatile unsigned long *)0x3FFFC020)
#define FIO1DIR_OFFSET 0x20

#define FIO1DIR0 (*(volatile unsigned char *)0x3FFFC020)
#define FIO1DIR0_OFFSET 0x20

#define FIO1DIR1 (*(volatile unsigned char *)0x3FFFC021)
#define FIO1DIR1_OFFSET 0x21

#define FIO1DIR2 (*(volatile unsigned char *)0x3FFFC022)
#define FIO1DIR2_OFFSET 0x22

#define FIO1DIR3 (*(volatile unsigned char *)0x3FFFC023)
#define FIO1DIR3_OFFSET 0x23

#define FIO1DIRL (*(volatile unsigned short *)0x3FFFC020)
#define FIO1DIRL_OFFSET 0x20

#define FIO1DIRH (*(volatile unsigned short *)0x3FFFC022)
#define FIO1DIRH_OFFSET 0x22

#define FIO1MASK (*(volatile unsigned long *)0x3FFFC030)
#define FIO1MASK_OFFSET 0x30

#define FIO1MASK0 (*(volatile unsigned char *)0x3FFFC030)
#define FIO1MASK0_OFFSET 0x30

#define FIO1MASK1 (*(volatile unsigned char *)0x3FFFC031)
#define FIO1MASK1_OFFSET 0x31

#define FIO1MASK2 (*(volatile unsigned char *)0x3FFFC032)
#define FIO1MASK2_OFFSET 0x32

#define FIO1MASK3 (*(volatile unsigned char *)0x3FFFC033)
#define FIO1MASK3_OFFSET 0x33

#define FIO1MASKL (*(volatile unsigned short *)0x3FFFC030)
#define FIO1MASKL_OFFSET 0x30

#define FIO1MASKH (*(volatile unsigned short *)0x3FFFC032)
#define FIO1MASKH_OFFSET 0x32

#define FIO1PIN (*(volatile unsigned long *)0x3FFFC034)
#define FIO1PIN_OFFSET 0x34

#define FIO1PIN0 (*(volatile unsigned char *)0x3FFFC034)
#define FIO1PIN0_OFFSET 0x34

#define FIO1PIN1 (*(volatile unsigned char *)0x3FFFC035)
#define FIO1PIN1_OFFSET 0x35

#define FIO1PIN2 (*(volatile unsigned char *)0x3FFFC036)
#define FIO1PIN2_OFFSET 0x36

#define FIO1PIN3 (*(volatile unsigned char *)0x3FFFC037)
#define FIO1PIN3_OFFSET 0x37

#define FIO1PINL (*(volatile unsigned short *)0x3FFFC034)
#define FIO1PINL_OFFSET 0x34

#define FIO1PINH (*(volatile unsigned short *)0x3FFFC036)
#define FIO1PINH_OFFSET 0x36

#define FIO1SET (*(volatile unsigned long *)0x3FFFC038)
#define FIO1SET_OFFSET 0x38

#define FIO1SET0 (*(volatile unsigned char *)0x3FFFC038)
#define FIO1SET0_OFFSET 0x38

#define FIO1SET1 (*(volatile unsigned char *)0x3FFFC039)
#define FIO1SET1_OFFSET 0x39

#define FIO1SET2 (*(volatile unsigned char *)0x3FFFC03A)
#define FIO1SET2_OFFSET 0x3A

#define FIO1SET3 (*(volatile unsigned char *)0x3FFFC03B)
#define FIO1SET3_OFFSET 0x3B

#define FIO1SETL (*(volatile unsigned short *)0x3FFFC038)
#define FIO1SETL_OFFSET 0x38

#define FIO1SETH (*(volatile unsigned short *)0x3FFFC03A)
#define FIO1SETH_OFFSET 0x3A

#define FIO1CLR (*(volatile unsigned long *)0x3FFFC03C)
#define FIO1CLR_OFFSET 0x3C

#define FIO1CLR0 (*(volatile unsigned char *)0x3FFFC03C)
#define FIO1CLR0_OFFSET 0x3C

