bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define FIO1CLR1 (*(volatile unsigned char *)0x3FFFC03D)
#define FIO1CLR1_OFFSET 0x3D

#define FIO1CLR2 (*(volatile unsigned char *)0x3FFFC03E)
#define FIO1CLR2_OFFSET 0x3E

#define FIO1CLR3 (*(volatile unsigned char *)0x3FFFC03F)
#define FIO1CLR3_OFFSET 0x3F

#define FIO1CLRL (*(volatile unsigned short *)0x3FFFC03C)
#define FIO1CLRL_OFFSET 0x3C

#define FIO1CLRH (*(volatile unsigned short *)0x3FFFC03E)
#define FIO1CLRH_OFFSET 0x3E

#define FIO2DIR (*(volatile unsigned long *)0x3FFFC040)
#define FIO2DIR_OFFSET 0x40

#define FIO2DIR0 (*(volatile unsigned char *)0x3FFFC040)
#define FIO2DIR0_OFFSET 0x40

#define FIO2DIR1 (*(volatile unsigned char *)0x3FFFC041)
#define FIO2DIR1_OFFSET 0x41

#define FIO2DIR2 (*(volatile unsigned char *)0x3FFFC042)
#define FIO2DIR2_OFFSET 0x42

#define FIO2DIR3 (*(volatile unsigned char *)0x3FFFC043)
#define FIO2DIR3_OFFSET 0x43

#define FIO2DIRL (*(volatile unsigned short *)0x3FFFC040)
#define FIO2DIRL_OFFSET 0x40

#define FIO2DIRH (*(volatile unsigned short *)0x3FFFC042)
#define FIO2DIRH_OFFSET 0x42

#define FIO2MASK (*(volatile unsigned long *)0x3FFFC050)
#define FIO2MASK_OFFSET 0x50

#define FIO2MASK0 (*(volatile unsigned char *)0x3FFFC050)
#define FIO2MASK0_OFFSET 0x50

#define FIO2MASK1 (*(volatile unsigned char *)0x3FFFC051)
#define FIO2MASK1_OFFSET 0x51

#define FIO2MASK2 (*(volatile unsigned char *)0x3FFFC052)
#define FIO2MASK2_OFFSET 0x52

#define FIO2MASK3 (*(volatile unsigned char *)0x3FFFC053)
#define FIO2MASK3_OFFSET 0x53

#define FIO2MASKL (*(volatile unsigned short *)0x3FFFC050)
#define FIO2MASKL_OFFSET 0x50

#define FIO2MASKH (*(volatile unsigned short *)0x3FFFC052)
#define FIO2MASKH_OFFSET 0x52

#define FIO2PIN (*(volatile unsigned long *)0x3FFFC054)
#define FIO2PIN_OFFSET 0x54

#define FIO2PIN0 (*(volatile unsigned char *)0x3FFFC054)
#define FIO2PIN0_OFFSET 0x54

#define FIO2PIN1 (*(volatile unsigned char *)0x3FFFC055)
#define FIO2PIN1_OFFSET 0x55

#define FIO2PIN2 (*(volatile unsigned char *)0x3FFFC056)
#define FIO2PIN2_OFFSET 0x56

#define FIO2PIN3 (*(volatile unsigned char *)0x3FFFC057)
#define FIO2PIN3_OFFSET 0x57

#define FIO2PINL (*(volatile unsigned short *)0x3FFFC054)
#define FIO2PINL_OFFSET 0x54

#define FIO2PINH (*(volatile unsigned short *)0x3FFFC056)
#define FIO2PINH_OFFSET 0x56

#define FIO2SET (*(volatile unsigned long *)0x3FFFC058)
#define FIO2SET_OFFSET 0x58

#define FIO2SET0 (*(volatile unsigned char *)0x3FFFC058)
#define FIO2SET0_OFFSET 0x58

#define FIO2SET1 (*(volatile unsigned char *)0x3FFFC059)
#define FIO2SET1_OFFSET 0x59

#define FIO2SET2 (*(volatile unsigned char *)0x3FFFC05A)
#define FIO2SET2_OFFSET 0x5A

#define FIO2SET3 (*(volatile unsigned char *)0x3FFFC05B)
#define FIO2SET3_OFFSET 0x5B

#define FIO2SETL (*(volatile unsigned short *)0x3FFFC058)
#define FIO2SETL_OFFSET 0x58

#define FIO2SETH (*(volatile unsigned short *)0x3FFFC05A)
#define FIO2SETH_OFFSET 0x5A

#define FIO2CLR (*(volatile unsigned long *)0x3FFFC05C)
#define FIO2CLR_OFFSET 0x5C

#define FIO2CLR0 (*(volatile unsigned char *)0x3FFFC05C)
#define FIO2CLR0_OFFSET 0x5C

#define FIO2CLR1 (*(volatile unsigned char *)0x3FFFC05D)
#define FIO2CLR1_OFFSET 0x5D

#define FIO2CLR2 (*(volatile unsigned char *)0x3FFFC05E)
#define FIO2CLR2_OFFSET 0x5E

#define FIO2CLR3 (*(volatile unsigned char *)0x3FFFC05F)
#define FIO2CLR3_OFFSET 0x5F

#define FIO2CLRL (*(volatile unsigned short *)0x3FFFC05C)
#define FIO2CLRL_OFFSET 0x5C

#define FIO2CLRH (*(volatile unsigned short *)0x3FFFC05E)
#define FIO2CLRH_OFFSET 0x5E

#define FIO3DIR (*(volatile unsigned long *)0x3FFFC060)
#define FIO3DIR_OFFSET 0x60

#define FIO3DIR0 (*(volatile unsigned char *)0x3FFFC060)
#define FIO3DIR0_OFFSET 0x60

#define FIO3DIR1 (*(volatile unsigned char *)0x3FFFC061)
#define FIO3DIR1_OFFSET 0x61

#define FIO3DIR2 (*(volatile unsigned char *)0x3FFFC062)
#define FIO3DIR2_OFFSET 0x62

#define FIO3DIR3 (*(volatile unsigned char *)0x3FFFC063)
#define FIO3DIR3_OFFSET 0x63

#define FIO3DIRL (*(volatile unsigned short *)0x3FFFC060)
#define FIO3DIRL_OFFSET 0x60

#define FIO3DIRH (*(volatile unsigned short *)0x3FFFC062)
#define FIO3DIRH_OFFSET 0x62

#define FIO3MASK (*(volatile unsigned long *)0x3FFFC070)
#define FIO3MASK_OFFSET 0x70

#define FIO3MASK0 (*(volatile unsigned char *)0x3FFFC070)
#define FIO3MASK0_OFFSET 0x70

#define FIO3MASK1 (*(volatile unsigned char *)0x3FFFC071)
#define FIO3MASK1_OFFSET 0x71

#define FIO3MASK2 (*(volatile unsigned char *)0x3FFFC072)
#define FIO3MASK2_OFFSET 0x72

#define FIO3MASK3 (*(volatile unsigned char *)0x3FFFC073)
#define FIO3MASK3_OFFSET 0x73

#define FIO3MASKL (*(volatile unsigned short *)0x3FFFC070)
#define FIO3MASKL_OFFSET 0x70

#define FIO3MASKH (*(volatile unsigned short *)0x3FFFC072)
#define FIO3MASKH_OFFSET 0x72

#define FIO3PIN (*(volatile unsigned long *)0x3FFFC074)
#define FIO3PIN_OFFSET 0x74

#define FIO3PIN0 (*(volatile unsigned char *)0x3FFFC074)
#define FIO3PIN0_OFFSET 0x74

#define FIO3PIN1 (*(volatile unsigned char *)0x3FFFC075)
#define FIO3PIN1_OFFSET 0x75

#define FIO3PIN2 (*(volatile unsigned char *)0x3FFFC076)
#define FIO3PIN2_OFFSET 0x76

#define FIO3PIN3 (*(volatile unsigned char *)0x3FFFC077)
#define FIO3PIN3_OFFSET 0x77

#define FIO3PINL (*(volatile unsigned short *)0x3FFFC074)
#define FIO3PINL_OFFSET 0x74

#define FIO3PINH (*(volatile unsigned short *)0x3FFFC076)
#define FIO3PINH_OFFSET 0x76

#define FIO3SET (*(volatile unsigned long *)0x3FFFC078)
#define FIO3SET_OFFSET 0x78

#define FIO3SET0 (*(volatile unsigned char *)0x3FFFC078)
#define FIO3SET0_OFFSET 0x78

#define FIO3SET1 (*(volatile unsigned char *)0x3FFFC079)
#define FIO3SET1_OFFSET 0x79

#define FIO3SET2 (*(volatile unsigned char *)0x3FFFC07A)
#define FIO3SET2_OFFSET 0x7A

#define FIO3SET3 (*(volatile unsigned char *)0x3FFFC07B)
#define FIO3SET3_OFFSET 0x7B

#define FIO3SETL (*(volatile unsigned short *)0x3FFFC078)
#define FIO3SETL_OFFSET 0x78

#define FIO3SETH (*(volatile unsigned short *)0x3FFFC07A)
#define FIO3SETH_OFFSET 0x7A

#define FIO3CLR (*(volatile unsigned long *)0x3FFFC07C)
#define FIO3CLR_OFFSET 0x7C

#define FIO3CLR0 (*(volatile unsigned char *)0x3FFFC07C)
#define FIO3CLR0_OFFSET 0x7C

#define FIO3CLR1 (*(volatile unsigned char *)0x3FFFC07D)
#define FIO3CLR1_OFFSET 0x7D

#define FIO3CLR2 (*(volatile unsigned char *)0x3FFFC07E)
#define FIO3CLR2_OFFSET 0x7E

