bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define PWM1IR (*(volatile unsigned long *)0xE0018000)
#define PWM1IR_OFFSET 0x0
#define PWM1IR_PWMMR0_Interrupt_MASK 0x1
#define PWM1IR_PWMMR0_Interrupt 0x1
#define PWM1IR_PWMMR0_Interrupt_BIT 0
#define PWM1IR_PWMMR1_Interrupt_MASK 0x2
#define PWM1IR_PWMMR1_Interrupt 0x2
#define PWM1IR_PWMMR1_Interrupt_BIT 1
#define PWM1IR_PWMMR2_Interrupt_MASK 0x4
#define PWM1IR_PWMMR2_Interrupt 0x4
#define PWM1IR_PWMMR2_Interrupt_BIT 2
#define PWM1IR_PWMMR3_Interrupt_MASK 0x8
#define PWM1IR_PWMMR3_Interrupt 0x8
#define PWM1IR_PWMMR3_Interrupt_BIT 3
#define PWM1IR_PWMMR4_Interrupt_MASK 0x100
#define PWM1IR_PWMMR4_Interrupt 0x100
#define PWM1IR_PWMMR4_Interrupt_BIT 8
#define PWM1IR_PWMMR5_Interrupt_MASK 0x200
#define PWM1IR_PWMMR5_Interrupt 0x200
#define PWM1IR_PWMMR5_Interrupt_BIT 9
#define PWM1IR_PWMMR6_Interrupt_MASK 0x400
#define PWM1IR_PWMMR6_Interrupt 0x400
#define PWM1IR_PWMMR6_Interrupt_BIT 10

#define PWM1TCR (*(volatile unsigned long *)0xE0018004)
#define PWM1TCR_OFFSET 0x4
#define PWM1TCR_Counter_Enable_MASK 0x1
#define PWM1TCR_Counter_Enable 0x1
#define PWM1TCR_Counter_Enable_BIT 0
#define PWM1TCR_Counter_Reset_MASK 0x2
#define PWM1TCR_Counter_Reset 0x2
#define PWM1TCR_Counter_Reset_BIT 1
#define PWM1TCR_PWM_Enable_MASK 0x8
#define PWM1TCR_PWM_Enable 0x8
#define PWM1TCR_PWM_Enable_BIT 3

#define PWM1TC (*(volatile unsigned long *)0xE0018008)
#define PWM1TC_OFFSET 0x8

#define PWM1PR (*(volatile unsigned long *)0xE001800C)
#define PWM1PR_OFFSET 0xC

#define PWM1PC (*(volatile unsigned long *)0xE0018010)
#define PWM1PC_OFFSET 0x10

#define PWM1MCR (*(volatile unsigned long *)0xE0018014)
#define PWM1MCR_OFFSET 0x14
#define PWM1MCR_PWMMR0I_MASK 0x1
#define PWM1MCR_PWMMR0I 0x1
#define PWM1MCR_PWMMR0I_BIT 0
#define PWM1MCR_PWMMR0R_MASK 0x2
#define PWM1MCR_PWMMR0R 0x2
#define PWM1MCR_PWMMR0R_BIT 1
#define PWM1MCR_PWMMR0S_MASK 0x4
#define PWM1MCR_PWMMR0S 0x4
#define PWM1MCR_PWMMR0S_BIT 2
#define PWM1MCR_PWMMR1I_MASK 0x8
#define PWM1MCR_PWMMR1I 0x8
#define PWM1MCR_PWMMR1I_BIT 3
#define PWM1MCR_PWMMR1R_MASK 0x10
#define PWM1MCR_PWMMR1R 0x10
#define PWM1MCR_PWMMR1R_BIT 4
#define PWM1MCR_PWMMR1S_MASK 0x20
#define PWM1MCR_PWMMR1S 0x20
#define PWM1MCR_PWMMR1S_BIT 5
#define PWM1MCR_PWMMR2I_MASK 0x40
#define PWM1MCR_PWMMR2I 0x40
#define PWM1MCR_PWMMR2I_BIT 6
#define PWM1MCR_PWMMR2R_MASK 0x80
#define PWM1MCR_PWMMR2R 0x80
#define PWM1MCR_PWMMR2R_BIT 7
#define PWM1MCR_PWMMR2S_MASK 0x100
#define PWM1MCR_PWMMR2S 0x100
#define PWM1MCR_PWMMR2S_BIT 8
#define PWM1MCR_PWMMR3I_MASK 0x200
#define PWM1MCR_PWMMR3I 0x200
#define PWM1MCR_PWMMR3I_BIT 9
#define PWM1MCR_PWMMR3R_MASK 0x400
#define PWM1MCR_PWMMR3R 0x400
#define PWM1MCR_PWMMR3R_BIT 10
#define PWM1MCR_PWMMR3S_MASK 0x800
#define PWM1MCR_PWMMR3S 0x800
#define PWM1MCR_PWMMR3S_BIT 11
#define PWM1MCR_PWMMR4I_MASK 0x1000
#define PWM1MCR_PWMMR4I 0x1000
#define PWM1MCR_PWMMR4I_BIT 12
#define PWM1MCR_PWMMR4R_MASK 0x2000
#define PWM1MCR_PWMMR4R 0x2000
#define PWM1MCR_PWMMR4R_BIT 13
#define PWM1MCR_PWMMR4S_MASK 0x4000
#define PWM1MCR_PWMMR4S 0x4000
#define PWM1MCR_PWMMR4S_BIT 14
#define PWM1MCR_PWMMR5I_MASK 0x8000
#define PWM1MCR_PWMMR5I 0x8000
#define PWM1MCR_PWMMR5I_BIT 15
#define PWM1MCR_PWMMR5R_MASK 0x10000
#define PWM1MCR_PWMMR5R 0x10000
#define PWM1MCR_PWMMR5R_BIT 16
#define PWM1MCR_PWMMR5S_MASK 0x20000
#define PWM1MCR_PWMMR5S 0x20000
#define PWM1MCR_PWMMR5S_BIT 17
#define PWM1MCR_PWMMR6I_MASK 0x40000
#define PWM1MCR_PWMMR6I 0x40000
#define PWM1MCR_PWMMR6I_BIT 18
#define PWM1MCR_PWMMR6R_MASK 0x80000
#define PWM1MCR_PWMMR6R 0x80000
#define PWM1MCR_PWMMR6R_BIT 19
#define PWM1MCR_PWMMR6S_MASK 0x100000
#define PWM1MCR_PWMMR6S 0x100000
#define PWM1MCR_PWMMR6S_BIT 20

#define PWM1MR0 (*(volatile unsigned long *)0xE0018018)
#define PWM1MR0_OFFSET 0x18

#define PWM1MR1 (*(volatile unsigned long *)0xE001801C)
#define PWM1MR1_OFFSET 0x1C

#define PWM1MR2 (*(volatile unsigned long *)0xE0018020)
#define PWM1MR2_OFFSET 0x20

#define PWM1MR3 (*(volatile unsigned long *)0xE0018024)
#define PWM1MR3_OFFSET 0x24

#define PWM1CCR (*(volatile unsigned long *)0xE0018028)
#define PWM1CCR_OFFSET 0x28
#define PWM1CCR_CAP0RE_MASK 0x1
#define PWM1CCR_CAP0RE 0x1
#define PWM1CCR_CAP0RE_BIT 0
#define PWM1CCR_CAP0FE_MASK 0x2
#define PWM1CCR_CAP0FE 0x2
#define PWM1CCR_CAP0FE_BIT 1
#define PWM1CCR_CAP0I_MASK 0x4
#define PWM1CCR_CAP0I 0x4
#define PWM1CCR_CAP0I_BIT 2
#define PWM1CCR_CAP1RE_MASK 0x8
#define PWM1CCR_CAP1RE 0x8
#define PWM1CCR_CAP1RE_BIT 3
#define PWM1CCR_CAP1FE_MASK 0x10
#define PWM1CCR_CAP1FE 0x10
#define PWM1CCR_CAP1FE_BIT 4
#define PWM1CCR_CAP1I_MASK 0x20
#define PWM1CCR_CAP1I 0x20
#define PWM1CCR_CAP1I_BIT 5
#define PWM1CCR_CAP2RE_MASK 0x80
#define PWM1CCR_CAP2RE 0x80
#define PWM1CCR_CAP2RE_BIT 7
#define PWM1CCR_CAP2FE_MASK 0x80
#define PWM1CCR_CAP2FE 0x80
#define PWM1CCR_CAP2FE_BIT 7
#define PWM1CCR_CAP2I_MASK 0x100
#define PWM1CCR_CAP2I 0x100
#define PWM1CCR_CAP2I_BIT 8
#define PWM1CCR_CAP3RE_MASK 0x200
#define PWM1CCR_CAP3RE 0x200
#define PWM1CCR_CAP3RE_BIT 9
#define PWM1CCR_CAP3FE_MASK 0x400
#define PWM1CCR_CAP3FE 0x400
#define PWM1CCR_CAP3FE_BIT 10
#define PWM1CCR_CAP3I_MASK 0x800
#define PWM1CCR_CAP3I 0x800
#define PWM1CCR_CAP3I_BIT 11

#define PWM1CR0 (*(volatile unsigned long *)0xE001802C)
#define PWM1CR0_OFFSET 0x2C

#define PWM1CR1 (*(volatile unsigned long *)0xE0018030)
#define PWM1CR1_OFFSET 0x30

#define PWM1CR2 (*(volatile unsigned long *)0xE0018034)
#define PWM1CR2_OFFSET 0x34

#define PWM1CR3 (*(volatile unsigned long *)0xE0018038)
#define PWM1CR3_OFFSET 0x38

#define PWM1EMR (*(volatile unsigned long *)0xE001803C)
#define PWM1EMR_OFFSET 0x3C
#define PWM1EMR_EM0_MASK 0x1
#define PWM1EMR_EM0 0x1
#define PWM1EMR_EM0_BIT 0
#define PWM1EMR_EM1_MASK 0x2
#define PWM1EMR_EM1 0x2
#define PWM1EMR_EM1_BIT 1
#define PWM1EMR_EM2_MASK 0x4
#define PWM1EMR_EM2 0x4
#define PWM1EMR_EM2_BIT 2
#define PWM1EMR_EM3_MASK 0x8
#define PWM1EMR_EM3 0x8
#define PWM1EMR_EM3_BIT 3
#define PWM1EMR_EMC0_MASK 0x30
#define PWM1EMR_EMC0_BIT 4
#define PWM1EMR_EMC1_MASK 0xC0
#define PWM1EMR_EMC1_BIT 6
#define PWM1EMR_EMC2_MASK 0x300
#define PWM1EMR_EMC2_BIT 8
#define PWM1EMR_EMC3_MASK 0xC00
#define PWM1EMR_EMC3_BIT 10

#define PWM1MR4 (*(volatile unsigned long *)0xE0018040)
#define PWM1MR4_OFFSET 0x40

#define PWM1MR5 (*(volatile unsigned long *)0xE0018044)
#define PWM1MR5_OFFSET 0x44

