bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define CIIR (*(volatile unsigned long *)0xE002400C)
#define CIIR_OFFSET 0xC
#define CIIR_IMSEC_MASK 0x1
#define CIIR_IMSEC 0x1
#define CIIR_IMSEC_BIT 0
#define CIIR_IMMIN_MASK 0x2
#define CIIR_IMMIN 0x2
#define CIIR_IMMIN_BIT 1
#define CIIR_IMHOUR_MASK 0x4
#define CIIR_IMHOUR 0x4
#define CIIR_IMHOUR_BIT 2
#define CIIR_IMDOM_MASK 0x8
#define CIIR_IMDOM 0x8
#define CIIR_IMDOM_BIT 3
#define CIIR_IMDOW_MASK 0x10
#define CIIR_IMDOW 0x10
#define CIIR_IMDOW_BIT 4
#define CIIR_IMDOY_MASK 0x20
#define CIIR_IMDOY 0x20
#define CIIR_IMDOY_BIT 5
#define CIIR_IMMON_MASK 0x40
#define CIIR_IMMON 0x40
#define CIIR_IMMON_BIT 6
#define CIIR_IMYEAR_MASK 0x80
#define CIIR_IMYEAR 0x80
#define CIIR_IMYEAR_BIT 7

#define AMR (*(volatile unsigned long *)0xE0024010)
#define AMR_OFFSET 0x10
#define AMR_AMRSEC_MASK 0x1
#define AMR_AMRSEC 0x1
#define AMR_AMRSEC_BIT 0
#define AMR_AMRMIN_MASK 0x2
#define AMR_AMRMIN 0x2
#define AMR_AMRMIN_BIT 1
#define AMR_AMRHOUR_MASK 0x4
#define AMR_AMRHOUR 0x4
#define AMR_AMRHOUR_BIT 2
#define AMR_AMRDOM_MASK 0x8
#define AMR_AMRDOM 0x8
#define AMR_AMRDOM_BIT 3
#define AMR_AMRDOW_MASK 0x10
#define AMR_AMRDOW 0x10
#define AMR_AMRDOW_BIT 4
#define AMR_AMRDOY_MASK 0x20
#define AMR_AMRDOY 0x20
#define AMR_AMRDOY_BIT 5
#define AMR_AMRMON_MASK 0x40
#define AMR_AMRMON 0x40
#define AMR_AMRMON_BIT 6
#define AMR_AMRYEAR_MASK 0x80
#define AMR_AMRYEAR 0x80
#define AMR_AMRYEAR_BIT 7

#define CTIME0 (*(volatile unsigned long *)0xE0024014)
#define CTIME0_OFFSET 0x14
#define CTIME0_Seconds_MASK 0x3F
#define CTIME0_Seconds_BIT 0
#define CTIME0_Minutes_MASK 0x3F00
#define CTIME0_Minutes_BIT 8
#define CTIME0_Hours_MASK 0x1F0000
#define CTIME0_Hours_BIT 16
#define CTIME0_Day_of_Week_MASK 0x7000000
#define CTIME0_Day_of_Week_BIT 24

#define CTIME1 (*(volatile unsigned long *)0xE0024018)
#define CTIME1_OFFSET 0x18
#define CTIME1_Day_of_Month_MASK 0x1F
#define CTIME1_Day_of_Month_BIT 0
#define CTIME1_Month_MASK 0xF00
#define CTIME1_Month_BIT 8
#define CTIME1_Year_MASK 0xFFF0000
#define CTIME1_Year_BIT 16

#define CTIME2 (*(volatile unsigned long *)0xE002401C)
#define CTIME2_OFFSET 0x1C
#define CTIME2_Day_of_Year_MASK 0xFFF
#define CTIME2_Day_of_Year_BIT 0

#define SEC (*(volatile unsigned long *)0xE0024020)
#define SEC_OFFSET 0x20

#define MIN (*(volatile unsigned long *)0xE0024024)
#define MIN_OFFSET 0x24

#define HOUR (*(volatile unsigned long *)0xE0024028)
#define HOUR_OFFSET 0x28

#define DOM (*(volatile unsigned long *)0xE002402C)
#define DOM_OFFSET 0x2C

#define DOW (*(volatile unsigned long *)0xE0024030)
#define DOW_OFFSET 0x30

#define DOY (*(volatile unsigned long *)0xE0024034)
#define DOY_OFFSET 0x34

#define MONTH (*(volatile unsigned long *)0xE0024038)
#define MONTH_OFFSET 0x38

#define YEAR (*(volatile unsigned long *)0xE002403C)
#define YEAR_OFFSET 0x3C

#define CISS (*(volatile unsigned long *)0xE0024040)
#define CISS_OFFSET 0x40
#define CISS_SubSecSel_MASK 0x7
#define CISS_SubSecSel_BIT 0
#define CISS_SubSecEna_MASK 0x80
#define CISS_SubSecEna 0x80
#define CISS_SubSecEna_BIT 7

#define ALSEC (*(volatile unsigned long *)0xE0024060)
#define ALSEC_OFFSET 0x60

#define ALMIN (*(volatile unsigned long *)0xE0024064)
#define ALMIN_OFFSET 0x64

#define ALHOUR (*(volatile unsigned long *)0xE0024068)
#define ALHOUR_OFFSET 0x68

#define ALDOM (*(volatile unsigned long *)0xE002406C)
#define ALDOM_OFFSET 0x6C

#define ALDOW (*(volatile unsigned long *)0xE0024070)
#define ALDOW_OFFSET 0x70

#define ALDOY (*(volatile unsigned long *)0xE0024074)
#define ALDOY_OFFSET 0x74

#define ALMON (*(volatile unsigned long *)0xE0024078)
#define ALMON_OFFSET 0x78

#define ALYEAR (*(volatile unsigned long *)0xE002407C)
#define ALYEAR_OFFSET 0x7C

#define PREINT (*(volatile unsigned long *)0xE0024080)
#define PREINT_OFFSET 0x80

#define PREFRAC (*(volatile unsigned long *)0xE0024084)
#define PREFRAC_OFFSET 0x84

#define GPIO_BASE 0xE0028000

#define IO0PIN (*(volatile unsigned long *)0xE0028000)
#define IO0PIN_OFFSET 0x0

#define IO0SET (*(volatile unsigned long *)0xE0028004)
#define IO0SET_OFFSET 0x4

#define IO0DIR (*(volatile unsigned long *)0xE0028008)
#define IO0DIR_OFFSET 0x8

#define IO0CLR (*(volatile unsigned long *)0xE002800C)
#define IO0CLR_OFFSET 0xC

#define IO1PIN (*(volatile unsigned long *)0xE0028010)
#define IO1PIN_OFFSET 0x10

#define IO1SET (*(volatile unsigned long *)0xE0028014)
#define IO1SET_OFFSET 0x14

#define IO1DIR (*(volatile unsigned long *)0xE0028018)
#define IO1DIR_OFFSET 0x18

#define IO1CLR (*(volatile unsigned long *)0xE002801C)
#define IO1CLR_OFFSET 0x1C

#define IOIntStatus (*(volatile unsigned long *)0xE0028080)
#define IOIntStatus_OFFSET 0x80
#define IOIntStatus_P0Int_MASK 0x1
#define IOIntStatus_P0Int 0x1
#define IOIntStatus_P0Int_BIT 0
#define IOIntStatus_P2Int_MASK 0x4
#define IOIntStatus_P2Int 0x4
#define IOIntStatus_P2Int_BIT 2

#define IO0IntStatR (*(volatile unsigned long *)0xE0028084)
#define IO0IntStatR_OFFSET 0x84

#define IO0IntStatF (*(volatile unsigned long *)0xE0028088)
#define IO0IntStatF_OFFSET 0x88

#define IO0IntClr (*(volatile unsigned long *)0xE002808C)
#define IO0IntClr_OFFSET 0x8C

#define IO0IntEnR (*(volatile unsigned long *)0xE0028090)
#define IO0IntEnR_OFFSET 0x90

#define IO0IntEnF (*(volatile unsigned long *)0xE0028094)
#define IO0IntEnF_OFFSET 0x94

#define IO2IntStatR (*(volatile unsigned long *)0xE00280A4)
#define IO2IntStatR_OFFSET 0xA4

#define IO2IntStatF (*(volatile unsigned long *)0xE00280A8)
#define IO2IntStatF_OFFSET 0xA8

#define IO2IntClr (*(volatile unsigned long *)0xE00280AC)
#define IO2IntClr_OFFSET 0xAC

#define IO2IntEnR (*(volatile unsigned long *)0xE00280B0)
#define IO2IntEnR_OFFSET 0xB0

#define IO2IntEnF (*(volatile unsigned long *)0xE00280B4)
#define IO2IntEnF_OFFSET 0xB4

#define PCB_BASE 0xE002C000

#define PINSEL0 (*(volatile unsigned long *)0xE002C000)
#define PINSEL0_OFFSET 0x0
#define PINSEL0_P0_0_MASK 0x3
#define PINSEL0_P0_0_BIT 0
#define PINSEL0_P0_1_MASK 0xC
#define PINSEL0_P0_1_BIT 2
#define PINSEL0_P0_2_MASK 0x30
#define PINSEL0_P0_2_BIT 4
#define PINSEL0_P0_3_MASK 0xC0
#define PINSEL0_P0_3_BIT 6
#define PINSEL0_P0_4_MASK 0x300
#define PINSEL0_P0_4_BIT 8
#define PINSEL0_P0_5_MASK 0xC00
#define PINSEL0_P0_5_BIT 10
#define PINSEL0_P0_6_MASK 0x3000
#define PINSEL0_P0_6_BIT 12
#define PINSEL0_P0_7_MASK 0xC000
#define PINSEL0_P0_7_BIT 14
#define PINSEL0_P0_8_MASK 0x30000
#define PINSEL0_P0_8_BIT 16
#define PINSEL0_P0_9_MASK 0xC0000
#define PINSEL0_P0_9_BIT 18
#define PINSEL0_P0_10_MASK 0x300000
#define PINSEL0_P0_10_BIT 20
#define PINSEL0_P0_11_MASK 0xC00000
#define PINSEL0_P0_11_BIT 22
#define PINSEL0_P0_12_MASK 0x3000000
#define PINSEL0_P0_12_BIT 24
#define PINSEL0_P0_13_MASK 0xC000000
#define PINSEL0_P0_13_BIT 26
#define PINSEL0_P0_14_MASK 0x30000000
#define PINSEL0_P0_14_BIT 28
#define PINSEL0_P0_15_MASK 0xC0000000
#define PINSEL0_P0_15_BIT 30

#define PINSEL1 (*(volatile unsigned long *)0xE002C004)
#define PINSEL1_OFFSET 0x4
#define PINSEL1_P0_16_MASK 0x3
#define PINSEL1_P0_16_BIT 0
#define PINSEL1_P0_17_MASK 0xC
#define PINSEL1_P0_17_BIT 2
#define PINSEL1_P0_18_MASK 0x30
#define PINSEL1_P0_18_BIT 4
#define PINSEL1_P0_19_MASK 0xC0
#define PINSEL1_P0_19_BIT 6
#define PINSEL1_P0_20_MASK 0x300
#define PINSEL1_P0_20_BIT 8
#define PINSEL1_P0_21_MASK 0xC00
#define PINSEL1_P0_21_BIT 10
#define PINSEL1_P0_22_MASK 0x3000
#define PINSEL1_P0_22_BIT 12
#define PINSEL1_P0_23_MASK 0xC000
#define PINSEL1_P0_23_BIT 14
#define PINSEL1_P0_24_MASK 0x30000
#define PINSEL1_P0_24_BIT 16
#define PINSEL1_P0_25_MASK 0xC0000
#define PINSEL1_P0_25_BIT 18
#define PINSEL1_P0_26_MASK 0x300000
#define PINSEL1_P0_26_BIT 20
#define PINSEL1_P0_27_MASK 0xC00000
#define PINSEL1_P0_27_BIT 22
#define PINSEL1_P0_28_MASK 0x3000000
#define PINSEL1_P0_28_BIT 24
#define PINSEL1_P0_29_MASK 0xC000000
#define PINSEL1_P0_29_BIT 26
#define PINSEL1_P0_30_MASK 0x30000000
#define PINSEL1_P0_30_BIT 28
#define PINSEL1_P0_31_MASK 0xC0000000
#define PINSEL1_P0_31_BIT 30

#define PINSEL2 (*(volatile unsigned long *)0xE002C008)
#define PINSEL2_OFFSET 0x8
#define PINSEL2_P1_0_MASK 0x3
#define PINSEL2_P1_0_BIT 0
#define PINSEL2_P1_1_MASK 0xC
#define PINSEL2_P1_1_BIT 2
#define PINSEL2_P1_2_MASK 0x30
#define PINSEL2_P1_2_BIT 4
#define PINSEL2_P1_3_MASK 0xC0
#define PINSEL2_P1_3_BIT 6
#define PINSEL2_P1_4_MASK 0x300
#define PINSEL2_P1_4_BIT 8
#define PINSEL2_P1_5_MASK 0xC00
#define PINSEL2_P1_5_BIT 10
#define PINSEL2_P1_6_MASK 0x3000
#define PINSEL2_P1_6_BIT 12
#define PINSEL2_P1_7_MASK 0xC000
#define PINSEL2_P1_7_BIT 14
#define PINSEL2_P1_8_MASK 0x30000
#define PINSEL2_P1_8_BIT 16
#define PINSEL2_P1_9_MASK 0xC0000
#define PINSEL2_P1_9_BIT 18
#define PINSEL2_P1_10_MASK 0x300000
#define PINSEL2_P1_10_BIT 20
#define PINSEL2_P1_11_MASK 0xC00000
#define PINSEL2_P1_11_BIT 22
#define PINSEL2_P1_12_MASK 0x3000000
#define PINSEL2_P1_12_BIT 24
#define PINSEL2_P1_13_MASK 0xC000000
#define PINSEL2_P1_13_BIT 26
#define PINSEL2_P1_14_MASK 0x30000000
#define PINSEL2_P1_14_BIT 28
#define PINSEL2_P1_15_MASK 0xC0000000
#define PINSEL2_P1_15_BIT 30

#define PINSEL3 (*(volatile unsigned long *)0xE002C00C)
#define PINSEL3_OFFSET 0xC
#define PINSEL3_P1_16_MASK 0x3
#define PINSEL3_P1_16_BIT 0
#define PINSEL3_P1_17_MASK 0xC
#define PINSEL3_P1_17_BIT 2
#define PINSEL3_P1_18_MASK 0x30
#define PINSEL3_P1_18_BIT 4
#define PINSEL3_P1_19_MASK 0xC0
#define PINSEL3_P1_19_BIT 6
#define PINSEL3_P1_20_MASK 0x300
#define PINSEL3_P1_20_BIT 8
#define PINSEL3_P1_21_MASK 0xC00
#define PINSEL3_P1_21_BIT 10
#define PINSEL3_P1_22_MASK 0x3000
#define PINSEL3_P1_22_BIT 12
#define PINSEL3_P1_23_MASK 0xC000
#define PINSEL3_P1_23_BIT 14
#define PINSEL3_P1_24_MASK 0x30000
#define PINSEL3_P1_24_BIT 16
#define PINSEL3_P1_25_MASK 0xC0000
#define PINSEL3_P1_25_BIT 18
#define PINSEL3_P1_26_MASK 0x300000
#define PINSEL3_P1_26_BIT 20
#define PINSEL3_P1_27_MASK 0xC00000
#define PINSEL3_P1_27_BIT 22
#define PINSEL3_P1_28_MASK 0x3000000
#define PINSEL3_P1_28_BIT 24
#define PINSEL3_P1_29_MASK 0xC000000
#define PINSEL3_P1_29_BIT 26
#define PINSEL3_P1_30_MASK 0x30000000
#define PINSEL3_P1_30_BIT 28
#define PINSEL3_P1_31_MASK 0xC0000000
#define PINSEL3_P1_31_BIT 30

#define PINSEL4 (*(volatile unsigned long *)0xE002C010)
#define PINSEL4_OFFSET 0x10
#define PINSEL4_P2_0_MASK 0x3
#define PINSEL4_P2_0_BIT 0
#define PINSEL4_P2_1_MASK 0xC
#define PINSEL4_P2_1_BIT 2
#define PINSEL4_P2_2_MASK 0x30
#define PINSEL4_P2_2_BIT 4
#define PINSEL4_P2_3_MASK 0xC0
#define PINSEL4_P2_3_BIT 6
#define PINSEL4_P2_4_MASK 0x300
#define PINSEL4_P2_4_BIT 8
#define PINSEL4_P2_5_MASK 0xC00
#define PINSEL4_P2_5_BIT 10
#define PINSEL4_P2_6_MASK 0x3000
#define PINSEL4_P2_6_BIT 12
#define PINSEL4_P2_7_MASK 0xC000
#define PINSEL4_P2_7_BIT 14
#define PINSEL4_P2_8_MASK 0x30000
#define PINSEL4_P2_8_BIT 16
#define PINSEL4_P2_9_MASK 0xC0000
#define PINSEL4_P2_9_BIT 18
#define PINSEL4_P2_10_MASK 0x300000
#define PINSEL4_P2_10_BIT 20
#define PINSEL4_P2_11_MASK 0xC00000
#define PINSEL4_P2_11_BIT 22
#define PINSEL4_P2_12_MASK 0x3000000
#define PINSEL4_P2_12_BIT 24
#define PINSEL4_P2_13_MASK 0xC000000
#define PINSEL4_P2_13_BIT 26
#define PINSEL4_P2_14_MASK 0x30000000
#define PINSEL4_P2_14_BIT 28
#define PINSEL4_P2_15_MASK 0xC0000000
#define PINSEL4_P2_15_BIT 30

