bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define PINSEL5 (*(volatile unsigned long *)0xE002C014)
#define PINSEL5_OFFSET 0x14
#define PINSEL5_P2_16_MASK 0x3
#define PINSEL5_P2_16_BIT 0
#define PINSEL5_P2_17_MASK 0xC
#define PINSEL5_P2_17_BIT 2
#define PINSEL5_P2_18_MASK 0x30
#define PINSEL5_P2_18_BIT 4
#define PINSEL5_P2_19_MASK 0xC0
#define PINSEL5_P2_19_BIT 6
#define PINSEL5_P2_20_MASK 0x300
#define PINSEL5_P2_20_BIT 8
#define PINSEL5_P2_21_MASK 0xC00
#define PINSEL5_P2_21_BIT 10
#define PINSEL5_P2_22_MASK 0x3000
#define PINSEL5_P2_22_BIT 12
#define PINSEL5_P2_23_MASK 0xC000
#define PINSEL5_P2_23_BIT 14
#define PINSEL5_P2_24_MASK 0x30000
#define PINSEL5_P2_24_BIT 16
#define PINSEL5_P2_25_MASK 0xC0000
#define PINSEL5_P2_25_BIT 18
#define PINSEL5_P2_26_MASK 0x300000
#define PINSEL5_P2_26_BIT 20
#define PINSEL5_P2_27_MASK 0xC00000
#define PINSEL5_P2_27_BIT 22
#define PINSEL5_P2_28_MASK 0x3000000
#define PINSEL5_P2_28_BIT 24
#define PINSEL5_P2_29_MASK 0xC000000
#define PINSEL5_P2_29_BIT 26
#define PINSEL5_P2_30_MASK 0x30000000
#define PINSEL5_P2_30_BIT 28
#define PINSEL5_P2_31_MASK 0xC0000000
#define PINSEL5_P2_31_BIT 30

#define PINSEL6 (*(volatile unsigned long *)0xE002C018)
#define PINSEL6_OFFSET 0x18
#define PINSEL6_P3_0_MASK 0x3
#define PINSEL6_P3_0_BIT 0
#define PINSEL6_P3_1_MASK 0xC
#define PINSEL6_P3_1_BIT 2
#define PINSEL6_P3_2_MASK 0x30
#define PINSEL6_P3_2_BIT 4
#define PINSEL6_P3_3_MASK 0xC0
#define PINSEL6_P3_3_BIT 6
#define PINSEL6_P3_4_MASK 0x300
#define PINSEL6_P3_4_BIT 8
#define PINSEL6_P3_5_MASK 0xC00
#define PINSEL6_P3_5_BIT 10
#define PINSEL6_P3_6_MASK 0x3000
#define PINSEL6_P3_6_BIT 12
#define PINSEL6_P3_7_MASK 0xC000
#define PINSEL6_P3_7_BIT 14
#define PINSEL6_P3_8_MASK 0x30000
#define PINSEL6_P3_8_BIT 16
#define PINSEL6_P3_9_MASK 0xC0000
#define PINSEL6_P3_9_BIT 18
#define PINSEL6_P3_10_MASK 0x300000
#define PINSEL6_P3_10_BIT 20
#define PINSEL6_P3_11_MASK 0xC00000
#define PINSEL6_P3_11_BIT 22
#define PINSEL6_P3_12_MASK 0x3000000
#define PINSEL6_P3_12_BIT 24
#define PINSEL6_P3_13_MASK 0xC000000
#define PINSEL6_P3_13_BIT 26
#define PINSEL6_P3_14_MASK 0x30000000
#define PINSEL6_P3_14_BIT 28
#define PINSEL6_P3_15_MASK 0xC0000000
#define PINSEL6_P3_15_BIT 30

#define PINSEL7 (*(volatile unsigned long *)0xE002C01C)
#define PINSEL7_OFFSET 0x1C
#define PINSEL7_P3_16_MASK 0x3
#define PINSEL7_P3_16_BIT 0
#define PINSEL7_P3_17_MASK 0xC
#define PINSEL7_P3_17_BIT 2
#define PINSEL7_P3_18_MASK 0x30
#define PINSEL7_P3_18_BIT 4
#define PINSEL7_P3_19_MASK 0xC0
#define PINSEL7_P3_19_BIT 6
#define PINSEL7_P3_20_MASK 0x300
#define PINSEL7_P3_20_BIT 8
#define PINSEL7_P3_21_MASK 0xC00
#define PINSEL7_P3_21_BIT 10
#define PINSEL7_P3_22_MASK 0x3000
#define PINSEL7_P3_22_BIT 12
#define PINSEL7_P3_23_MASK 0xC000
#define PINSEL7_P3_23_BIT 14
#define PINSEL7_P3_24_MASK 0x30000
#define PINSEL7_P3_24_BIT 16
#define PINSEL7_P3_25_MASK 0xC0000
#define PINSEL7_P3_25_BIT 18
#define PINSEL7_P3_26_MASK 0x300000
#define PINSEL7_P3_26_BIT 20
#define PINSEL7_P3_27_MASK 0xC00000
#define PINSEL7_P3_27_BIT 22
#define PINSEL7_P3_28_MASK 0x3000000
#define PINSEL7_P3_28_BIT 24
#define PINSEL7_P3_29_MASK 0xC000000
#define PINSEL7_P3_29_BIT 26
#define PINSEL7_P3_30_MASK 0x30000000
#define PINSEL7_P3_30_BIT 28
#define PINSEL7_P3_31_MASK 0xC0000000
#define PINSEL7_P3_31_BIT 30

#define PINSEL8 (*(volatile unsigned long *)0xE002C020)
#define PINSEL8_OFFSET 0x20
#define PINSEL8_P4_0_MASK 0x3
#define PINSEL8_P4_0_BIT 0
#define PINSEL8_P4_1_MASK 0xC
#define PINSEL8_P4_1_BIT 2
#define PINSEL8_P4_2_MASK 0x30
#define PINSEL8_P4_2_BIT 4
#define PINSEL8_P4_3_MASK 0xC0
#define PINSEL8_P4_3_BIT 6
#define PINSEL8_P4_4_MASK 0x300
#define PINSEL8_P4_4_BIT 8
#define PINSEL8_P4_5_MASK 0xC00
#define PINSEL8_P4_5_BIT 10
#define PINSEL8_P4_6_MASK 0x3000
#define PINSEL8_P4_6_BIT 12
#define PINSEL8_P4_7_MASK 0xC000
#define PINSEL8_P4_7_BIT 14
#define PINSEL8_P4_8_MASK 0x30000
#define PINSEL8_P4_8_BIT 16
#define PINSEL8_P4_9_MASK 0xC0000
#define PINSEL8_P4_9_BIT 18
#define PINSEL8_P4_10_MASK 0x300000
#define PINSEL8_P4_10_BIT 20
#define PINSEL8_P4_11_MASK 0xC00000
#define PINSEL8_P4_11_BIT 22
#define PINSEL8_P4_12_MASK 0x3000000
#define PINSEL8_P4_12_BIT 24
#define PINSEL8_P4_13_MASK 0xC000000
#define PINSEL8_P4_13_BIT 26
#define PINSEL8_P4_14_MASK 0x30000000
#define PINSEL8_P4_14_BIT 28
#define PINSEL8_P4_15_MASK 0xC0000000
#define PINSEL8_P4_15_BIT 30

#define PINSEL9 (*(volatile unsigned long *)0xE002C024)
#define PINSEL9_OFFSET 0x24
#define PINSEL9_P4_16_MASK 0x3
#define PINSEL9_P4_16_BIT 0
#define PINSEL9_P4_17_MASK 0xC
#define PINSEL9_P4_17_BIT 2
#define PINSEL9_P4_18_MASK 0x30
#define PINSEL9_P4_18_BIT 4
#define PINSEL9_P4_19_MASK 0xC0
#define PINSEL9_P4_19_BIT 6
#define PINSEL9_P4_20_MASK 0x300
#define PINSEL9_P4_20_BIT 8
#define PINSEL9_P4_21_MASK 0xC00
#define PINSEL9_P4_21_BIT 10
#define PINSEL9_P4_22_MASK 0x3000
#define PINSEL9_P4_22_BIT 12
#define PINSEL9_P4_23_MASK 0xC000
#define PINSEL9_P4_23_BIT 14
#define PINSEL9_P4_24_MASK 0x30000
#define PINSEL9_P4_24_BIT 16
#define PINSEL9_P4_25_MASK 0xC0000
#define PINSEL9_P4_25_BIT 18
#define PINSEL9_P4_26_MASK 0x300000
#define PINSEL9_P4_26_BIT 20
#define PINSEL9_P4_27_MASK 0xC00000
#define PINSEL9_P4_27_BIT 22
#define PINSEL9_P4_28_MASK 0x3000000
#define PINSEL9_P4_28_BIT 24
#define PINSEL9_P4_29_MASK 0xC000000
#define PINSEL9_P4_29_BIT 26
#define PINSEL9_P4_30_MASK 0x30000000
#define PINSEL9_P4_30_BIT 28
#define PINSEL9_P4_31_MASK 0xC0000000
#define PINSEL9_P4_31_BIT 30

#define PINSEL10 (*(volatile unsigned long *)0xE002C028)
#define PINSEL10_OFFSET 0x28
#define PINSEL10_GPIO_TRACE_MASK 0x8
#define PINSEL10_GPIO_TRACE 0x8
#define PINSEL10_GPIO_TRACE_BIT 3

#define PINMODE0 (*(volatile unsigned long *)0xE002C040)
#define PINMODE0_OFFSET 0x40

#define PINMODE1 (*(volatile unsigned long *)0xE002C044)
#define PINMODE1_OFFSET 0x44

#define PINMODE2 (*(volatile unsigned long *)0xE002C048)
#define PINMODE2_OFFSET 0x48

#define PINMODE3 (*(volatile unsigned long *)0xE002C04C)
#define PINMODE3_OFFSET 0x4C

#define PINMODE4 (*(volatile unsigned long *)0xE002C050)
#define PINMODE4_OFFSET 0x50

#define PINMODE5 (*(volatile unsigned long *)0xE002C054)
#define PINMODE5_OFFSET 0x54

