bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define T2MR3 (*(volatile unsigned long *)0xE0070024)
#define T2MR3_OFFSET 0x24

#define T2CCR (*(volatile unsigned short *)0xE0070028)
#define T2CCR_OFFSET 0x28
#define T2CCR_CAP0RE_MASK 0x1
#define T2CCR_CAP0RE 0x1
#define T2CCR_CAP0RE_BIT 0
#define T2CCR_CAP0FE_MASK 0x2
#define T2CCR_CAP0FE 0x2
#define T2CCR_CAP0FE_BIT 1
#define T2CCR_CAP0I_MASK 0x4
#define T2CCR_CAP0I 0x4
#define T2CCR_CAP0I_BIT 2
#define T2CCR_CAP1RE_MASK 0x8
#define T2CCR_CAP1RE 0x8
#define T2CCR_CAP1RE_BIT 3
#define T2CCR_CAP1FE_MASK 0x10
#define T2CCR_CAP1FE 0x10
#define T2CCR_CAP1FE_BIT 4
#define T2CCR_CAP1I_MASK 0x20
#define T2CCR_CAP1I 0x20
#define T2CCR_CAP1I_BIT 5
#define T2CCR_CAP2RE_MASK 0x40
#define T2CCR_CAP2RE 0x40
#define T2CCR_CAP2RE_BIT 6
#define T2CCR_CAP2FE_MASK 0x80
#define T2CCR_CAP2FE 0x80
#define T2CCR_CAP2FE_BIT 7
#define T2CCR_CAP2I_MASK 0x100
#define T2CCR_CAP2I 0x100
#define T2CCR_CAP2I_BIT 8
#define T2CCR_CAP3RE_MASK 0x200
#define T2CCR_CAP3RE 0x200
#define T2CCR_CAP3RE_BIT 9
#define T2CCR_CAP3FE_MASK 0x400
#define T2CCR_CAP3FE 0x400
#define T2CCR_CAP3FE_BIT 10
#define T2CCR_CAP3I_MASK 0x800
#define T2CCR_CAP3I 0x800
#define T2CCR_CAP3I_BIT 11

#define T2CR0 (*(volatile unsigned long *)0xE007002C)
#define T2CR0_OFFSET 0x2C

#define T2CR1 (*(volatile unsigned long *)0xE0070030)
#define T2CR1_OFFSET 0x30

#define T2CR2 (*(volatile unsigned long *)0xE0070034)
#define T2CR2_OFFSET 0x34

#define T2CR3 (*(volatile unsigned long *)0xE0070038)
#define T2CR3_OFFSET 0x38

#define T2EMR (*(volatile unsigned short *)0xE007003C)
#define T2EMR_OFFSET 0x3C
#define T2EMR_EM0_MASK 0x1
#define T2EMR_EM0 0x1
#define T2EMR_EM0_BIT 0
#define T2EMR_EM1_MASK 0x2
#define T2EMR_EM1 0x2
#define T2EMR_EM1_BIT 1
#define T2EMR_EM2_MASK 0x4
#define T2EMR_EM2 0x4
#define T2EMR_EM2_BIT 2
#define T2EMR_EM3_MASK 0x8
#define T2EMR_EM3 0x8
#define T2EMR_EM3_BIT 3
#define T2EMR_EMC0_MASK 0x30
#define T2EMR_EMC0_BIT 4
#define T2EMR_EMC1_MASK 0xC0
#define T2EMR_EMC1_BIT 6
#define T2EMR_EMC2_MASK 0x300
#define T2EMR_EMC2_BIT 8
#define T2EMR_EMC3_MASK 0xC00
#define T2EMR_EMC3_BIT 10

#define T2CTCR (*(volatile unsigned long *)0xE0070070)
#define T2CTCR_OFFSET 0x70
#define T2CTCR_Counter_Timer_Mode_MASK 0x3
#define T2CTCR_Counter_Timer_Mode_BIT 0
#define T2CTCR_Count_Input_Select_MASK 0xC
#define T2CTCR_Count_Input_Select_BIT 2

#define TIMER3_BASE 0xE0074000

#define T3IR (*(volatile unsigned char *)0xE0074000)
#define T3IR_OFFSET 0x0
#define T3IR_MR0_MASK 0x1
#define T3IR_MR0 0x1
#define T3IR_MR0_BIT 0
#define T3IR_MR1_MASK 0x2
#define T3IR_MR1 0x2
#define T3IR_MR1_BIT 1
#define T3IR_MR2_MASK 0x4
#define T3IR_MR2 0x4
#define T3IR_MR2_BIT 2
#define T3IR_MR3_MASK 0x8
#define T3IR_MR3 0x8
#define T3IR_MR3_BIT 3
#define T3IR_CR0_MASK 0x10
#define T3IR_CR0 0x10
#define T3IR_CR0_BIT 4
#define T3IR_CR1_MASK 0x20
#define T3IR_CR1 0x20
#define T3IR_CR1_BIT 5
#define T3IR_CR2_MASK 0x40
#define T3IR_CR2 0x40
#define T3IR_CR2_BIT 6
#define T3IR_CR3_MASK 0x80
#define T3IR_CR3 0x80
#define T3IR_CR3_BIT 7

#define T3TCR (*(volatile unsigned char *)0xE0074004)
#define T3TCR_OFFSET 0x4
#define T3TCR_Counter_Enable_MASK 0x1
#define T3TCR_Counter_Enable 0x1
#define T3TCR_Counter_Enable_BIT 0
#define T3TCR_Counter_Reset_MASK 0x2
#define T3TCR_Counter_Reset 0x2
#define T3TCR_Counter_Reset_BIT 1

#define T3TC (*(volatile unsigned long *)0xE0074008)
#define T3TC_OFFSET 0x8

#define T3PR (*(volatile unsigned long *)0xE007400C)
#define T3PR_OFFSET 0xC

#define T3PC (*(volatile unsigned long *)0xE0074010)
#define T3PC_OFFSET 0x10

#define T3MCR (*(volatile unsigned short *)0xE0074014)
#define T3MCR_OFFSET 0x14
#define T3MCR_MR0I_MASK 0x1
#define T3MCR_MR0I 0x1
#define T3MCR_MR0I_BIT 0
#define T3MCR_MR0R_MASK 0x2
#define T3MCR_MR0R 0x2
#define T3MCR_MR0R_BIT 1
#define T3MCR_MR0S_MASK 0x4
#define T3MCR_MR0S 0x4
#define T3MCR_MR0S_BIT 2
#define T3MCR_MR1I_MASK 0x8
#define T3MCR_MR1I 0x8
#define T3MCR_MR1I_BIT 3
#define T3MCR_MR1R_MASK 0x10
#define T3MCR_MR1R 0x10
#define T3MCR_MR1R_BIT 4
#define T3MCR_MR1S_MASK 0x20
#define T3MCR_MR1S 0x20
#define T3MCR_MR1S_BIT 5
#define T3MCR_MR2I_MASK 0x40
#define T3MCR_MR2I 0x40
#define T3MCR_MR2I_BIT 6
#define T3MCR_MR2R_MASK 0x80
#define T3MCR_MR2R 0x80
#define T3MCR_MR2R_BIT 7
#define T3MCR_MR2S_MASK 0x100
#define T3MCR_MR2S 0x100
#define T3MCR_MR2S_BIT 8
#define T3MCR_MR3I_MASK 0x200
#define T3MCR_MR3I 0x200
#define T3MCR_MR3I_BIT 9
#define T3MCR_MR3R_MASK 0x400
#define T3MCR_MR3R 0x400
#define T3MCR_MR3R_BIT 10
#define T3MCR_MR3S_MASK 0x800
#define T3MCR_MR3S 0x800
#define T3MCR_MR3S_BIT 11

#define T3MR0 (*(volatile unsigned long *)0xE0074018)
#define T3MR0_OFFSET 0x18

#define T3MR1 (*(volatile unsigned long *)0xE007401C)
#define T3MR1_OFFSET 0x1C

#define T3MR2 (*(volatile unsigned long *)0xE0074020)
#define T3MR2_OFFSET 0x20

#define T3MR3 (*(volatile unsigned long *)0xE0074024)
#define T3MR3_OFFSET 0x24

#define T3CCR (*(volatile unsigned short *)0xE0074028)
#define T3CCR_OFFSET 0x28
#define T3CCR_CAP0RE_MASK 0x1
#define T3CCR_CAP0RE 0x1
#define T3CCR_CAP0RE_BIT 0
#define T3CCR_CAP0FE_MASK 0x2
#define T3CCR_CAP0FE 0x2
#define T3CCR_CAP0FE_BIT 1
#define T3CCR_CAP0I_MASK 0x4
#define T3CCR_CAP0I 0x4
#define T3CCR_CAP0I_BIT 2
#define T3CCR_CAP1RE_MASK 0x8
#define T3CCR_CAP1RE 0x8
#define T3CCR_CAP1RE_BIT 3
#define T3CCR_CAP1FE_MASK 0x10
#define T3CCR_CAP1FE 0x10
#define T3CCR_CAP1FE_BIT 4
#define T3CCR_CAP1I_MASK 0x20
#define T3CCR_CAP1I 0x20
#define T3CCR_CAP1I_BIT 5
#define T3CCR_CAP2RE_MASK 0x40
#define T3CCR_CAP2RE 0x40
#define T3CCR_CAP2RE_BIT 6
#define T3CCR_CAP2FE_MASK 0x80
#define T3CCR_CAP2FE 0x80
#define T3CCR_CAP2FE_BIT 7
#define T3CCR_CAP2I_MASK 0x100
#define T3CCR_CAP2I 0x100
#define T3CCR_CAP2I_BIT 8
#define T3CCR_CAP3RE_MASK 0x200
#define T3CCR_CAP3RE 0x200
#define T3CCR_CAP3RE_BIT 9
#define T3CCR_CAP3FE_MASK 0x400
#define T3CCR_CAP3FE 0x400
#define T3CCR_CAP3FE_BIT 10
#define T3CCR_CAP3I_MASK 0x800
#define T3CCR_CAP3I 0x800
#define T3CCR_CAP3I_BIT 11

#define T3CR0 (*(volatile unsigned long *)0xE007402C)
#define T3CR0_OFFSET 0x2C

#define T3CR1 (*(volatile unsigned long *)0xE0074030)
#define T3CR1_OFFSET 0x30

