bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define MCIResponse2 (*(volatile unsigned long *)0xE008C01C)
#define MCIResponse2_OFFSET 0x1C

#define MCIResponse3 (*(volatile unsigned long *)0xE008C020)
#define MCIResponse3_OFFSET 0x20

#define MCIDataTimer (*(volatile unsigned long *)0xE008C024)
#define MCIDataTimer_OFFSET 0x24

#define MCIDataLength (*(volatile unsigned long *)0xE008C028)
#define MCIDataLength_OFFSET 0x28
#define MCIDataLength_DataLength_MASK 0xFFFF
#define MCIDataLength_DataLength_BIT 0

#define MCIDataCtrl (*(volatile unsigned long *)0xE008C02C)
#define MCIDataCtrl_OFFSET 0x2C
#define MCIDataCtrl_Enable_MASK 0x1
#define MCIDataCtrl_Enable 0x1
#define MCIDataCtrl_Enable_BIT 0
#define MCIDataCtrl_Direction_MASK 0x2
#define MCIDataCtrl_Direction 0x2
#define MCIDataCtrl_Direction_BIT 1
#define MCIDataCtrl_Mode_MASK 0x4
#define MCIDataCtrl_Mode 0x4
#define MCIDataCtrl_Mode_BIT 2
#define MCIDataCtrl_DMAEnable_MASK 0x8
#define MCIDataCtrl_DMAEnable 0x8
#define MCIDataCtrl_DMAEnable_BIT 3
#define MCIDataCtrl_BlockSize_MASK 0xF0
#define MCIDataCtrl_BlockSize_BIT 4

#define MCIDataCnt (*(volatile unsigned long *)0xE008C030)
#define MCIDataCnt_OFFSET 0x30
#define MCIDataCnt_DataCount_MASK 0xFFFF
#define MCIDataCnt_DataCount_BIT 0

#define MCIStatus (*(volatile unsigned long *)0xE008C034)
#define MCIStatus_OFFSET 0x34
#define MCIStatus_CmdCrcFail_MASK 0x1
#define MCIStatus_CmdCrcFail 0x1
#define MCIStatus_CmdCrcFail_BIT 0
#define MCIStatus_DataCrcFail_MASK 0x2
#define MCIStatus_DataCrcFail 0x2
#define MCIStatus_DataCrcFail_BIT 1
#define MCIStatus_CmdTimeOut_MASK 0x4
#define MCIStatus_CmdTimeOut 0x4
#define MCIStatus_CmdTimeOut_BIT 2
#define MCIStatus_DataTimeOut_MASK 0x8
#define MCIStatus_DataTimeOut 0x8
#define MCIStatus_DataTimeOut_BIT 3
#define MCIStatus_TxUnderrun_MASK 0x10
#define MCIStatus_TxUnderrun 0x10
#define MCIStatus_TxUnderrun_BIT 4
#define MCIStatus_RxOverrun_MASK 0x20
#define MCIStatus_RxOverrun 0x20
#define MCIStatus_RxOverrun_BIT 5
#define MCIStatus_CmdRespEnd_MASK 0x40
#define MCIStatus_CmdRespEnd 0x40
#define MCIStatus_CmdRespEnd_BIT 6
#define MCIStatus_CmdSent_MASK 0x80
#define MCIStatus_CmdSent 0x80
#define MCIStatus_CmdSent_BIT 7
#define MCIStatus_DataEnd_MASK 0x100
#define MCIStatus_DataEnd 0x100
#define MCIStatus_DataEnd_BIT 8
#define MCIStatus_StartBitErr_MASK 0x200
#define MCIStatus_StartBitErr 0x200
#define MCIStatus_StartBitErr_BIT 9
#define MCIStatus_DataBlockEnd_MASK 0x400
#define MCIStatus_DataBlockEnd 0x400
#define MCIStatus_DataBlockEnd_BIT 10
#define MCIStatus_CmdActive_MASK 0x800
#define MCIStatus_CmdActive 0x800
#define MCIStatus_CmdActive_BIT 11
#define MCIStatus_TxActive_MASK 0x1000
#define MCIStatus_TxActive 0x1000
#define MCIStatus_TxActive_BIT 12
#define MCIStatus_RxActive_MASK 0x2000
#define MCIStatus_RxActive 0x2000
#define MCIStatus_RxActive_BIT 13
#define MCIStatus_TxFifoHalfEmpty_MASK 0x4000
#define MCIStatus_TxFifoHalfEmpty 0x4000
#define MCIStatus_TxFifoHalfEmpty_BIT 14
#define MCIStatus_RxFifoHalfEmpty_MASK 0x8000
#define MCIStatus_RxFifoHalfEmpty 0x8000
#define MCIStatus_RxFifoHalfEmpty_BIT 15
#define MCIStatus_TxFifoFull_MASK 0x10000
#define MCIStatus_TxFifoFull 0x10000
#define MCIStatus_TxFifoFull_BIT 16
#define MCIStatus_RxFifoFull_MASK 0x20000
#define MCIStatus_RxFifoFull 0x20000
#define MCIStatus_RxFifoFull_BIT 17
#define MCIStatus_TxFifoEmpty_MASK 0x40000
#define MCIStatus_TxFifoEmpty 0x40000
#define MCIStatus_TxFifoEmpty_BIT 18
#define MCIStatus_RxFifoEmpty_MASK 0x80000
#define MCIStatus_RxFifoEmpty 0x80000
#define MCIStatus_RxFifoEmpty_BIT 19
#define MCIStatus_TxDataAvlbl_MASK 0x100000
#define MCIStatus_TxDataAvlbl 0x100000
#define MCIStatus_TxDataAvlbl_BIT 20
#define MCIStatus_RxDataAvlbl_MASK 0x200000
#define MCIStatus_RxDataAvlbl 0x200000
#define MCIStatus_RxDataAvlbl_BIT 21

#define MCIClear (*(volatile unsigned long *)0xE008C038)
#define MCIClear_OFFSET 0x38
#define MCIClear_CmdCrcFailClr_MASK 0x1
#define MCIClear_CmdCrcFailClr 0x1
#define MCIClear_CmdCrcFailClr_BIT 0
#define MCIClear_DataCrcFailClr_MASK 0x2
#define MCIClear_DataCrcFailClr 0x2
#define MCIClear_DataCrcFailClr_BIT 1
#define MCIClear_CmdTimeOutClr_MASK 0x4
#define MCIClear_CmdTimeOutClr 0x4
#define MCIClear_CmdTimeOutClr_BIT 2
#define MCIClear_DataTimeOutClr_MASK 0x8
#define MCIClear_DataTimeOutClr 0x8
#define MCIClear_DataTimeOutClr_BIT 3
#define MCIClear_TxUnderrunClr_MASK 0x10
#define MCIClear_TxUnderrunClr 0x10
#define MCIClear_TxUnderrunClr_BIT 4
#define MCIClear_RxOverrunClr_MASK 0x20
#define MCIClear_RxOverrunClr 0x20
#define MCIClear_RxOverrunClr_BIT 5
#define MCIClear_CmdRespEndClr_MASK 0x40
#define MCIClear_CmdRespEndClr 0x40
#define MCIClear_CmdRespEndClr_BIT 6
#define MCIClear_CmdSentClr_MASK 0x80
#define MCIClear_CmdSentClr 0x80
#define MCIClear_CmdSentClr_BIT 7
#define MCIClear_DataEndClr_MASK 0x100
#define MCIClear_DataEndClr 0x100
#define MCIClear_DataEndClr_BIT 8
#define MCIClear_StartBitErrClr_MASK 0x200
#define MCIClear_StartBitErrClr 0x200
#define MCIClear_StartBitErrClr_BIT 9
#define MCIClear_DataBlockEndClr_MASK 0x400
#define MCIClear_DataBlockEndClr 0x400
#define MCIClear_DataBlockEndClr_BIT 10

#define MCIMask0 (*(volatile unsigned long *)0xE008C03C)
#define MCIMask0_OFFSET 0x3C

#define MCIMask1 (*(volatile unsigned long *)0xE008C040)
#define MCIMask1_OFFSET 0x40

#define MCIFifoCnt (*(volatile unsigned long *)0xE008C048)
#define MCIFifoCnt_OFFSET 0x48
#define MCIFifoCnt_DataCount_MASK 0x7FFF
#define MCIFifoCnt_DataCount_BIT 0

#define MCIFIFO (*(volatile unsigned long *)0xE008C080)
#define MCIFIFO_OFFSET 0x80

#define SCB_BASE 0xE01FC000

#define MAMCR (*(volatile unsigned char *)0xE01FC000)
#define MAMCR_OFFSET 0x0
#define MAMCR_MAM_mode_control_MASK 0x3
#define MAMCR_MAM_mode_control_BIT 0

#define MAMTIM (*(volatile unsigned char *)0xE01FC004)
#define MAMTIM_OFFSET 0x4
#define MAMTIM_MAM_fetch_cycle_timing_MASK 0x7
#define MAMTIM_MAM_fetch_cycle_timing_BIT 0

#define MEMMAP (*(volatile unsigned char *)0xE01FC040)
#define MEMMAP_OFFSET 0x40
#define MEMMAP_MAP_MASK 0x3
#define MEMMAP_MAP_BIT 0

#define PLLCON (*(volatile unsigned char *)0xE01FC080)
#define PLLCON_OFFSET 0x80
#define PLLCON_PLLE_MASK 0x1
#define PLLCON_PLLE 0x1
#define PLLCON_PLLE_BIT 0
#define PLLCON_PLLC_MASK 0x2
#define PLLCON_PLLC 0x2
#define PLLCON_PLLC_BIT 1

#define PLLCFG (*(volatile unsigned long *)0xE01FC084)
#define PLLCFG_OFFSET 0x84
#define PLLCFG_MSEL_MASK 0x7FFF
#define PLLCFG_MSEL_BIT 0
#define PLLCFG_NSEL_MASK 0xFF0000
#define PLLCFG_NSEL_BIT 16

