bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define IntStatus (*(volatile unsigned *)0xFFE00FE0)
#define IntStatus_OFFSET 0xFE0
#define IntStatus_RxOverrunInt_MASK 0x1
#define IntStatus_RxOverrunInt 0x1
#define IntStatus_RxOverrunInt_BIT 0
#define IntStatus_RxErrorInt_MASK 0x2
#define IntStatus_RxErrorInt 0x2
#define IntStatus_RxErrorInt_BIT 1
#define IntStatus_RxFinishedInt_MASK 0x4
#define IntStatus_RxFinishedInt 0x4
#define IntStatus_RxFinishedInt_BIT 2
#define IntStatus_RxDoneInt_MASK 0x8
#define IntStatus_RxDoneInt 0x8
#define IntStatus_RxDoneInt_BIT 3
#define IntStatus_TxUnderrunInt_MASK 0x10
#define IntStatus_TxUnderrunInt 0x10
#define IntStatus_TxUnderrunInt_BIT 4
#define IntStatus_TxErrorInt_MASK 0x20
#define IntStatus_TxErrorInt 0x20
#define IntStatus_TxErrorInt_BIT 5
#define IntStatus_TxFinishedInt_MASK 0x40
#define IntStatus_TxFinishedInt 0x40
#define IntStatus_TxFinishedInt_BIT 6
#define IntStatus_TxDoneInt_MASK 0x80
#define IntStatus_TxDoneInt 0x80
#define IntStatus_TxDoneInt_BIT 7
#define IntStatus_SoftInt_MASK 0x1000
#define IntStatus_SoftInt 0x1000
#define IntStatus_SoftInt_BIT 12
#define IntStatus_WakeupInt_MASK 0x2000
#define IntStatus_WakeupInt 0x2000
#define IntStatus_WakeupInt_BIT 13

#define IntEnable (*(volatile unsigned *)0xFFE00FE4)
#define IntEnable_OFFSET 0xFE4
#define IntEnable_RxOverrunIntEn_MASK 0x1
#define IntEnable_RxOverrunIntEn 0x1
#define IntEnable_RxOverrunIntEn_BIT 0
#define IntEnable_RxErrorIntEn_MASK 0x2
#define IntEnable_RxErrorIntEn 0x2
#define IntEnable_RxErrorIntEn_BIT 1
#define IntEnable_RxFinishedIntEn_MASK 0x4
#define IntEnable_RxFinishedIntEn 0x4
#define IntEnable_RxFinishedIntEn_BIT 2
#define IntEnable_RxDoneIntEn_MASK 0x8
#define IntEnable_RxDoneIntEn 0x8
#define IntEnable_RxDoneIntEn_BIT 3
#define IntEnable_TxUnderrunIntEn_MASK 0x10
#define IntEnable_TxUnderrunIntEn 0x10
#define IntEnable_TxUnderrunIntEn_BIT 4
#define IntEnable_TxErrorIntEn_MASK 0x20
#define IntEnable_TxErrorIntEn 0x20
#define IntEnable_TxErrorIntEn_BIT 5
#define IntEnable_TxFinishedIntEn_MASK 0x40
#define IntEnable_TxFinishedIntEn 0x40
#define IntEnable_TxFinishedIntEn_BIT 6
#define IntEnable_TxDoneIntEn_MASK 0x80
#define IntEnable_TxDoneIntEn 0x80
#define IntEnable_TxDoneIntEn_BIT 7
#define IntEnable_SoftIntEn_MASK 0x1000
#define IntEnable_SoftIntEn 0x1000
#define IntEnable_SoftIntEn_BIT 12
#define IntEnable_WakeupIntEn_MASK 0x2000
#define IntEnable_WakeupIntEn 0x2000
#define IntEnable_WakeupIntEn_BIT 13

#define IntClear (*(volatile unsigned *)0xFFE00FE8)
#define IntClear_OFFSET 0xFE8
#define IntClear_RxOverrunIntClr_MASK 0x1
#define IntClear_RxOverrunIntClr 0x1
#define IntClear_RxOverrunIntClr_BIT 0
#define IntClear_RxErrorIntClr_MASK 0x2
#define IntClear_RxErrorIntClr 0x2
#define IntClear_RxErrorIntClr_BIT 1
#define IntClear_RxFinishedIntClr_MASK 0x4
#define IntClear_RxFinishedIntClr 0x4
#define IntClear_RxFinishedIntClr_BIT 2
#define IntClear_RxDoneIntClr_MASK 0x8
#define IntClear_RxDoneIntClr 0x8
#define IntClear_RxDoneIntClr_BIT 3
#define IntClear_TxUnderrunIntClr_MASK 0x10
#define IntClear_TxUnderrunIntClr 0x10
#define IntClear_TxUnderrunIntClr_BIT 4
#define IntClear_TxErrorIntClr_MASK 0x20
#define IntClear_TxErrorIntClr 0x20
#define IntClear_TxErrorIntClr_BIT 5
#define IntClear_TxFinishedIntClr_MASK 0x40
#define IntClear_TxFinishedIntClr 0x40
#define IntClear_TxFinishedIntClr_BIT 6
#define IntClear_TxDoneIntClr_MASK 0x80
#define IntClear_TxDoneIntClr 0x80
#define IntClear_TxDoneIntClr_BIT 7
#define IntClear_SoftIntClr_MASK 0x1000
#define IntClear_SoftIntClr 0x1000
#define IntClear_SoftIntClr_BIT 12
#define IntClear_WakeupIntClr_MASK 0x2000
#define IntClear_WakeupIntClr 0x2000
#define IntClear_WakeupIntClr_BIT 13

#define IntSet (*(volatile unsigned *)0xFFE00FEC)
#define IntSet_OFFSET 0xFEC
#define IntSet_RxOverrunIntSet_MASK 0x1
#define IntSet_RxOverrunIntSet 0x1
#define IntSet_RxOverrunIntSet_BIT 0
#define IntSet_RxErrorIntSet_MASK 0x2
#define IntSet_RxErrorIntSet 0x2
#define IntSet_RxErrorIntSet_BIT 1
#define IntSet_RxFinishedIntSet_MASK 0x4
#define IntSet_RxFinishedIntSet 0x4
#define IntSet_RxFinishedIntSet_BIT 2
#define IntSet_RxDoneIntSet_MASK 0x8
#define IntSet_RxDoneIntSet 0x8
#define IntSet_RxDoneIntSet_BIT 3
#define IntSet_TxUnderrunIntSet_MASK 0x10
#define IntSet_TxUnderrunIntSet 0x10
#define IntSet_TxUnderrunIntSet_BIT 4
#define IntSet_TxErrorIntSet_MASK 0x20
#define IntSet_TxErrorIntSet 0x20
#define IntSet_TxErrorIntSet_BIT 5
#define IntSet_TxFinishedIntSet_MASK 0x40
#define IntSet_TxFinishedIntSet 0x40
#define IntSet_TxFinishedIntSet_BIT 6
#define IntSet_TxDoneIntSet_MASK 0x80
#define IntSet_TxDoneIntSet 0x80
#define IntSet_TxDoneIntSet_BIT 7
#define IntSet_SoftIntSet_MASK 0x1000
#define IntSet_SoftIntSet 0x1000
#define IntSet_SoftIntSet_BIT 12
#define IntSet_WakeupIntSet_MASK 0x2000
#define IntSet_WakeupIntSet 0x2000
#define IntSet_WakeupIntSet_BIT 13

#define PowerDown (*(volatile unsigned *)0xFFE00FF4)
#define PowerDown_OFFSET 0xFF4
#define PowerDown_PowerDownMACAHB_MASK 0x80000000
#define PowerDown_PowerDownMACAHB 0x80000000
#define PowerDown_PowerDownMACAHB_BIT 31

#define GPDMA_BASE 0xFFE04000

#define DMACIntStatus (*(volatile unsigned *)0xFFE04000)
#define DMACIntStatus_OFFSET 0x0
#define DMACIntStatus_IntStatus0_MASK 0x1
#define DMACIntStatus_IntStatus0 0x1
#define DMACIntStatus_IntStatus0_BIT 0
#define DMACIntStatus_IntStatus1_MASK 0x2
#define DMACIntStatus_IntStatus1 0x2
#define DMACIntStatus_IntStatus1_BIT 1

#define DMACIntTCStatus (*(volatile unsigned *)0xFFE04004)
#define DMACIntTCStatus_OFFSET 0x4
#define DMACIntTCStatus_IntTCStatus0_MASK 0x1
#define DMACIntTCStatus_IntTCStatus0 0x1
#define DMACIntTCStatus_IntTCStatus0_BIT 0
#define DMACIntTCStatus_IntTCStatus1_MASK 0x2
#define DMACIntTCStatus_IntTCStatus1 0x2
#define DMACIntTCStatus_IntTCStatus1_BIT 1

#define DMACIntTCClear (*(volatile unsigned *)0xFFE04008)
#define DMACIntTCClear_OFFSET 0x8
#define DMACIntTCClear_IntTCClear0_MASK 0x1
#define DMACIntTCClear_IntTCClear0 0x1
#define DMACIntTCClear_IntTCClear0_BIT 0
#define DMACIntTCClear_IntTCClear1_MASK 0x2
#define DMACIntTCClear_IntTCClear1 0x2
#define DMACIntTCClear_IntTCClear1_BIT 1

#define DMACIntErrorStatus (*(volatile unsigned *)0xFFE0400C)
#define DMACIntErrorStatus_OFFSET 0xC
#define DMACIntErrorStatus_IntErrorStatus0_MASK 0x1
#define DMACIntErrorStatus_IntErrorStatus0 0x1
#define DMACIntErrorStatus_IntErrorStatus0_BIT 0
#define DMACIntErrorStatus_IntErrorStatus1_MASK 0x2
#define DMACIntErrorStatus_IntErrorStatus1 0x2
#define DMACIntErrorStatus_IntErrorStatus1_BIT 1

#define DMACIntErrClr (*(volatile unsigned *)0xFFE04010)
#define DMACIntErrClr_OFFSET 0x10
#define DMACIntErrClr_IntErrClr0_MASK 0x1
#define DMACIntErrClr_IntErrClr0 0x1
#define DMACIntErrClr_IntErrClr0_BIT 0
#define DMACIntErrClr_IntErrClr1_MASK 0x2
#define DMACIntErrClr_IntErrClr1 0x2
#define DMACIntErrClr_IntErrClr1_BIT 1

