bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define USBSysErrIntSet (*(volatile unsigned *)0xFFE0C2C0)
#define USBSysErrIntSet_OFFSET 0x2C0
#define USBSysErrIntSet_EP0_MASK 0x1
#define USBSysErrIntSet_EP0 0x1
#define USBSysErrIntSet_EP0_BIT 0
#define USBSysErrIntSet_EP1_MASK 0x2
#define USBSysErrIntSet_EP1 0x2
#define USBSysErrIntSet_EP1_BIT 1
#define USBSysErrIntSet_EP2_MASK 0x4
#define USBSysErrIntSet_EP2 0x4
#define USBSysErrIntSet_EP2_BIT 2
#define USBSysErrIntSet_EP3_MASK 0x8
#define USBSysErrIntSet_EP3 0x8
#define USBSysErrIntSet_EP3_BIT 3
#define USBSysErrIntSet_EP4_MASK 0x10
#define USBSysErrIntSet_EP4 0x10
#define USBSysErrIntSet_EP4_BIT 4
#define USBSysErrIntSet_EP5_MASK 0x20
#define USBSysErrIntSet_EP5 0x20
#define USBSysErrIntSet_EP5_BIT 5
#define USBSysErrIntSet_EP6_MASK 0x40
#define USBSysErrIntSet_EP6 0x40
#define USBSysErrIntSet_EP6_BIT 6
#define USBSysErrIntSet_EP7_MASK 0x80
#define USBSysErrIntSet_EP7 0x80
#define USBSysErrIntSet_EP7_BIT 7
#define USBSysErrIntSet_EP8_MASK 0x100
#define USBSysErrIntSet_EP8 0x100
#define USBSysErrIntSet_EP8_BIT 8
#define USBSysErrIntSet_EP9_MASK 0x200
#define USBSysErrIntSet_EP9 0x200
#define USBSysErrIntSet_EP9_BIT 9
#define USBSysErrIntSet_EP10_MASK 0x400
#define USBSysErrIntSet_EP10 0x400
#define USBSysErrIntSet_EP10_BIT 10
#define USBSysErrIntSet_EP11_MASK 0x800
#define USBSysErrIntSet_EP11 0x800
#define USBSysErrIntSet_EP11_BIT 11
#define USBSysErrIntSet_EP12_MASK 0x1000
#define USBSysErrIntSet_EP12 0x1000
#define USBSysErrIntSet_EP12_BIT 12
#define USBSysErrIntSet_EP13_MASK 0x2000
#define USBSysErrIntSet_EP13 0x2000
#define USBSysErrIntSet_EP13_BIT 13
#define USBSysErrIntSet_EP14_MASK 0x4000
#define USBSysErrIntSet_EP14 0x4000
#define USBSysErrIntSet_EP14_BIT 14
#define USBSysErrIntSet_EP15_MASK 0x8000
#define USBSysErrIntSet_EP15 0x8000
#define USBSysErrIntSet_EP15_BIT 15
#define USBSysErrIntSet_EP16_MASK 0x10000
#define USBSysErrIntSet_EP16 0x10000
#define USBSysErrIntSet_EP16_BIT 16
#define USBSysErrIntSet_EP17_MASK 0x20000
#define USBSysErrIntSet_EP17 0x20000
#define USBSysErrIntSet_EP17_BIT 17
#define USBSysErrIntSet_EP18_MASK 0x40000
#define USBSysErrIntSet_EP18 0x40000
#define USBSysErrIntSet_EP18_BIT 18
#define USBSysErrIntSet_EP19_MASK 0x80000
#define USBSysErrIntSet_EP19 0x80000
#define USBSysErrIntSet_EP19_BIT 19
#define USBSysErrIntSet_EP20_MASK 0x100000
#define USBSysErrIntSet_EP20 0x100000
#define USBSysErrIntSet_EP20_BIT 20
#define USBSysErrIntSet_EP21_MASK 0x200000
#define USBSysErrIntSet_EP21 0x200000
#define USBSysErrIntSet_EP21_BIT 21
#define USBSysErrIntSet_EP22_MASK 0x400000
#define USBSysErrIntSet_EP22 0x400000
#define USBSysErrIntSet_EP22_BIT 22
#define USBSysErrIntSet_EP23_MASK 0x800000
#define USBSysErrIntSet_EP23 0x800000
#define USBSysErrIntSet_EP23_BIT 23
#define USBSysErrIntSet_EP24_MASK 0x1000000
#define USBSysErrIntSet_EP24 0x1000000
#define USBSysErrIntSet_EP24_BIT 24
#define USBSysErrIntSet_EP25_MASK 0x2000000
#define USBSysErrIntSet_EP25 0x2000000
#define USBSysErrIntSet_EP25_BIT 25
#define USBSysErrIntSet_EP26_MASK 0x4000000
#define USBSysErrIntSet_EP26 0x4000000
#define USBSysErrIntSet_EP26_BIT 26
#define USBSysErrIntSet_EP27_MASK 0x8000000
#define USBSysErrIntSet_EP27 0x8000000
#define USBSysErrIntSet_EP27_BIT 27
#define USBSysErrIntSet_EP28_MASK 0x10000000
#define USBSysErrIntSet_EP28 0x10000000
#define USBSysErrIntSet_EP28_BIT 28
#define USBSysErrIntSet_EP29_MASK 0x20000000
#define USBSysErrIntSet_EP29 0x20000000
#define USBSysErrIntSet_EP29_BIT 29
#define USBSysErrIntSet_EP30_MASK 0x40000000
#define USBSysErrIntSet_EP30 0x40000000
#define USBSysErrIntSet_EP30_BIT 30
#define USBSysErrIntSet_EP31_MASK 0x80000000
#define USBSysErrIntSet_EP31 0x80000000
#define USBSysErrIntSet_EP31_BIT 31

#define USBClkCtrl (*(volatile unsigned *)0xFFE0CFF4)
#define USBClkCtrl_OFFSET 0xFF4
#define USBClkCtrl_DEV_CLK_EN_MASK 0x2
#define USBClkCtrl_DEV_CLK_EN 0x2
#define USBClkCtrl_DEV_CLK_EN_BIT 1
#define USBClkCtrl_PORTSEL_CLK_EN_MASK 0x8
#define USBClkCtrl_PORTSEL_CLK_EN 0x8
#define USBClkCtrl_PORTSEL_CLK_EN_BIT 3
#define USBClkCtrl_AHB_CLK_EN_MASK 0x10
#define USBClkCtrl_AHB_CLK_EN 0x10
#define USBClkCtrl_AHB_CLK_EN_BIT 4

#define USBClkSt (*(volatile unsigned *)0xFFE0CFF8)
#define USBClkSt_OFFSET 0xFF8
#define USBClkSt_DEV_CLK_EN_MASK 0x2
#define USBClkSt_DEV_CLK_EN 0x2
#define USBClkSt_DEV_CLK_EN_BIT 1
#define USBClkSt_PORTSEL_CLK_EN_MASK 0x8
#define USBClkSt_PORTSEL_CLK_EN 0x8
#define USBClkSt_PORTSEL_CLK_EN_BIT 3
#define USBClkSt_AHB_CLK_EN_MASK 0x10
#define USBClkSt_AHB_CLK_EN 0x10
#define USBClkSt_AHB_CLK_EN_BIT 4

#define VIC_BASE 0xFFFFF000

#define VICIRQStatus (*(volatile unsigned long *)0xFFFFF000)
#define VICIRQStatus_OFFSET 0x0
#define VICIRQStatus_WDT_MASK 0x1
#define VICIRQStatus_WDT 0x1
#define VICIRQStatus_WDT_BIT 0
#define VICIRQStatus_ARMCore0_MASK 0x4
#define VICIRQStatus_ARMCore0 0x4
#define VICIRQStatus_ARMCore0_BIT 2
#define VICIRQStatus_ARMCore1_MASK 0x8
#define VICIRQStatus_ARMCore1 0x8
#define VICIRQStatus_ARMCore1_BIT 3
#define VICIRQStatus_TIMER0_MASK 0x10
#define VICIRQStatus_TIMER0 0x10
#define VICIRQStatus_TIMER0_BIT 4
#define VICIRQStatus_TIMER1_MASK 0x20
#define VICIRQStatus_TIMER1 0x20
#define VICIRQStatus_TIMER1_BIT 5
#define VICIRQStatus_UART0_MASK 0x40
#define VICIRQStatus_UART0 0x40
#define VICIRQStatus_UART0_BIT 6
#define VICIRQStatus_UART1_MASK 0x80
#define VICIRQStatus_UART1 0x80
#define VICIRQStatus_UART1_BIT 7
#define VICIRQStatus_PWM1_MASK 0x100
#define VICIRQStatus_PWM1 0x100
#define VICIRQStatus_PWM1_BIT 8
#define VICIRQStatus_I2C0_MASK 0x200
#define VICIRQStatus_I2C0 0x200
#define VICIRQStatus_I2C0_BIT 9
#define VICIRQStatus_SPI_SSP0_MASK 0x400
#define VICIRQStatus_SPI_SSP0 0x400
#define VICIRQStatus_SPI_SSP0_BIT 10
#define VICIRQStatus_SSP1_MASK 0x800
#define VICIRQStatus_SSP1 0x800
#define VICIRQStatus_SSP1_BIT 11
#define VICIRQStatus_PLL_MASK 0x1000
#define VICIRQStatus_PLL 0x1000
#define VICIRQStatus_PLL_BIT 12
#define VICIRQStatus_RTC_MASK 0x2000
#define VICIRQStatus_RTC 0x2000
#define VICIRQStatus_RTC_BIT 13
#define VICIRQStatus_EINT0_MASK 0x4000
#define VICIRQStatus_EINT0 0x4000
#define VICIRQStatus_EINT0_BIT 14
#define VICIRQStatus_EINT1_MASK 0x8000
#define VICIRQStatus_EINT1 0x8000
#define VICIRQStatus_EINT1_BIT 15
#define VICIRQStatus_EINT2_MASK 0x10000
#define VICIRQStatus_EINT2 0x10000
#define VICIRQStatus_EINT2_BIT 16
#define VICIRQStatus_EINT3_MASK 0x20000
#define VICIRQStatus_EINT3 0x20000
#define VICIRQStatus_EINT3_BIT 17
#define VICIRQStatus_AD0_MASK 0x40000
#define VICIRQStatus_AD0 0x40000
#define VICIRQStatus_AD0_BIT 18
#define VICIRQStatus_I2C1_MASK 0x80000
#define VICIRQStatus_I2C1 0x80000
#define VICIRQStatus_I2C1_BIT 19
#define VICIRQStatus_BOD_MASK 0x100000
#define VICIRQStatus_BOD 0x100000
#define VICIRQStatus_BOD_BIT 20
#define VICIRQStatus_Ethernet_MASK 0x200000
#define VICIRQStatus_Ethernet 0x200000
#define VICIRQStatus_Ethernet_BIT 21
#define VICIRQStatus_USB_MASK 0x400000
#define VICIRQStatus_USB 0x400000
#define VICIRQStatus_USB_BIT 22
#define VICIRQStatus_CAN1_2_MASK 0x800000
#define VICIRQStatus_CAN1_2 0x800000
#define VICIRQStatus_CAN1_2_BIT 23
#define VICIRQStatus_SD_MMC_MASK 0x1000000
#define VICIRQStatus_SD_MMC 0x1000000
#define VICIRQStatus_SD_MMC_BIT 24
#define VICIRQStatus_GPDMA_MASK 0x2000000
#define VICIRQStatus_GPDMA 0x2000000
#define VICIRQStatus_GPDMA_BIT 25
#define VICIRQStatus_TIMER2_MASK 0x4000000
#define VICIRQStatus_TIMER2 0x4000000
#define VICIRQStatus_TIMER2_BIT 26
#define VICIRQStatus_TIMER3_MASK 0x8000000
#define VICIRQStatus_TIMER3 0x8000000
#define VICIRQStatus_TIMER3_BIT 27
#define VICIRQStatus_UART2_MASK 0x10000000
#define VICIRQStatus_UART2 0x10000000
#define VICIRQStatus_UART2_BIT 28
#define VICIRQStatus_UART3_MASK 0x20000000
#define VICIRQStatus_UART3 0x20000000
#define VICIRQStatus_UART3_BIT 29
#define VICIRQStatus_I2C2_MASK 0x40000000
#define VICIRQStatus_I2C2 0x40000000
#define VICIRQStatus_I2C2_BIT 30
#define VICIRQStatus_I2S_MASK 0x80000000
#define VICIRQStatus_I2S 0x80000000
#define VICIRQStatus_I2S_BIT 31

#define VICFIQStatus (*(volatile unsigned long *)0xFFFFF004)
#define VICFIQStatus_OFFSET 0x4
#define VICFIQStatus_WDT_MASK 0x1
#define VICFIQStatus_WDT 0x1
#define VICFIQStatus_WDT_BIT 0
#define VICFIQStatus_ARMCore0_MASK 0x4
#define VICFIQStatus_ARMCore0 0x4
#define VICFIQStatus_ARMCore0_BIT 2
#define VICFIQStatus_ARMCore1_MASK 0x8
#define VICFIQStatus_ARMCore1 0x8
#define VICFIQStatus_ARMCore1_BIT 3
#define VICFIQStatus_TIMER0_MASK 0x10
#define VICFIQStatus_TIMER0 0x10
#define VICFIQStatus_TIMER0_BIT 4
#define VICFIQStatus_TIMER1_MASK 0x20
#define VICFIQStatus_TIMER1 0x20
#define VICFIQStatus_TIMER1_BIT 5
#define VICFIQStatus_UART0_MASK 0x40
#define VICFIQStatus_UART0 0x40
#define VICFIQStatus_UART0_BIT 6
#define VICFIQStatus_UART1_MASK 0x80
#define VICFIQStatus_UART1 0x80
#define VICFIQStatus_UART1_BIT 7
#define VICFIQStatus_PWM1_MASK 0x100
#define VICFIQStatus_PWM1 0x100
#define VICFIQStatus_PWM1_BIT 8
#define VICFIQStatus_I2C0_MASK 0x200
#define VICFIQStatus_I2C0 0x200
#define VICFIQStatus_I2C0_BIT 9
#define VICFIQStatus_SPI_SSP0_MASK 0x400
#define VICFIQStatus_SPI_SSP0 0x400
#define VICFIQStatus_SPI_SSP0_BIT 10
#define VICFIQStatus_SSP1_MASK 0x800
#define VICFIQStatus_SSP1 0x800
#define VICFIQStatus_SSP1_BIT 11
#define VICFIQStatus_PLL_MASK 0x1000
#define VICFIQStatus_PLL 0x1000
#define VICFIQStatus_PLL_BIT 12
#define VICFIQStatus_RTC_MASK 0x2000
#define VICFIQStatus_RTC 0x2000
#define VICFIQStatus_RTC_BIT 13
#define VICFIQStatus_EINT0_MASK 0x4000
#define VICFIQStatus_EINT0 0x4000
#define VICFIQStatus_EINT0_BIT 14
#define VICFIQStatus_EINT1_MASK 0x8000
#define VICFIQStatus_EINT1 0x8000
#define VICFIQStatus_EINT1_BIT 15
#define VICFIQStatus_EINT2_MASK 0x10000
#define VICFIQStatus_EINT2 0x10000
#define VICFIQStatus_EINT2_BIT 16
#define VICFIQStatus_EINT3_MASK 0x20000
#define VICFIQStatus_EINT3 0x20000
#define VICFIQStatus_EINT3_BIT 17
#define VICFIQStatus_AD0_MASK 0x40000
#define VICFIQStatus_AD0 0x40000
#define VICFIQStatus_AD0_BIT 18
#define VICFIQStatus_I2C1_MASK 0x80000
#define VICFIQStatus_I2C1 0x80000
#define VICFIQStatus_I2C1_BIT 19
#define VICFIQStatus_BOD_MASK 0x100000
#define VICFIQStatus_BOD 0x100000
#define VICFIQStatus_BOD_BIT 20
#define VICFIQStatus_Ethernet_MASK 0x200000
#define VICFIQStatus_Ethernet 0x200000
#define VICFIQStatus_Ethernet_BIT 21
#define VICFIQStatus_USB_MASK 0x400000
#define VICFIQStatus_USB 0x400000
#define VICFIQStatus_USB_BIT 22
#define VICFIQStatus_CAN1_2_MASK 0x800000
#define VICFIQStatus_CAN1_2 0x800000
#define VICFIQStatus_CAN1_2_BIT 23
#define VICFIQStatus_SD_MMC_MASK 0x1000000
#define VICFIQStatus_SD_MMC 0x1000000
#define VICFIQStatus_SD_MMC_BIT 24
#define VICFIQStatus_GPDMA_MASK 0x2000000
#define VICFIQStatus_GPDMA 0x2000000
#define VICFIQStatus_GPDMA_BIT 25
#define VICFIQStatus_TIMER2_MASK 0x4000000
#define VICFIQStatus_TIMER2 0x4000000
#define VICFIQStatus_TIMER2_BIT 26
#define VICFIQStatus_TIMER3_MASK 0x8000000
#define VICFIQStatus_TIMER3 0x8000000
#define VICFIQStatus_TIMER3_BIT 27
#define VICFIQStatus_UART2_MASK 0x10000000
#define VICFIQStatus_UART2 0x10000000
#define VICFIQStatus_UART2_BIT 28
#define VICFIQStatus_UART3_MASK 0x20000000
#define VICFIQStatus_UART3 0x20000000
#define VICFIQStatus_UART3_BIT 29
#define VICFIQStatus_I2C2_MASK 0x40000000
#define VICFIQStatus_I2C2 0x40000000
#define VICFIQStatus_I2C2_BIT 30
#define VICFIQStatus_I2S_MASK 0x80000000
#define VICFIQStatus_I2S 0x80000000
#define VICFIQStatus_I2S_BIT 31

#define VICRawIntr (*(volatile unsigned long *)0xFFFFF008)
#define VICRawIntr_OFFSET 0x8
#define VICRawIntr_WDT_MASK 0x1
#define VICRawIntr_WDT 0x1
#define VICRawIntr_WDT_BIT 0
#define VICRawIntr_ARMCore0_MASK 0x4
#define VICRawIntr_ARMCore0 0x4
#define VICRawIntr_ARMCore0_BIT 2
#define VICRawIntr_ARMCore1_MASK 0x8
#define VICRawIntr_ARMCore1 0x8
#define VICRawIntr_ARMCore1_BIT 3
#define VICRawIntr_TIMER0_MASK 0x10
#define VICRawIntr_TIMER0 0x10
#define VICRawIntr_TIMER0_BIT 4
#define VICRawIntr_TIMER1_MASK 0x20
#define VICRawIntr_TIMER1 0x20
#define VICRawIntr_TIMER1_BIT 5
#define VICRawIntr_UART0_MASK 0x40
#define VICRawIntr_UART0 0x40
#define VICRawIntr_UART0_BIT 6
#define VICRawIntr_UART1_MASK 0x80
#define VICRawIntr_UART1 0x80
#define VICRawIntr_UART1_BIT 7
#define VICRawIntr_PWM1_MASK 0x100
#define VICRawIntr_PWM1 0x100
#define VICRawIntr_PWM1_BIT 8
#define VICRawIntr_I2C0_MASK 0x200
#define VICRawIntr_I2C0 0x200
#define VICRawIntr_I2C0_BIT 9
#define VICRawIntr_SPI_SSP0_MASK 0x400
#define VICRawIntr_SPI_SSP0 0x400
#define VICRawIntr_SPI_SSP0_BIT 10
#define VICRawIntr_SSP1_MASK 0x800
#define VICRawIntr_SSP1 0x800
#define VICRawIntr_SSP1_BIT 11
#define VICRawIntr_PLL_MASK 0x1000
#define VICRawIntr_PLL 0x1000
#define VICRawIntr_PLL_BIT 12
#define VICRawIntr_RTC_MASK 0x2000
#define VICRawIntr_RTC 0x2000
#define VICRawIntr_RTC_BIT 13
#define VICRawIntr_EINT0_MASK 0x4000
#define VICRawIntr_EINT0 0x4000
#define VICRawIntr_EINT0_BIT 14
#define VICRawIntr_EINT1_MASK 0x8000
#define VICRawIntr_EINT1 0x8000
#define VICRawIntr_EINT1_BIT 15
#define VICRawIntr_EINT2_MASK 0x10000
#define VICRawIntr_EINT2 0x10000
#define VICRawIntr_EINT2_BIT 16
#define VICRawIntr_EINT3_MASK 0x20000
#define VICRawIntr_EINT3 0x20000
#define VICRawIntr_EINT3_BIT 17
#define VICRawIntr_AD0_MASK 0x40000
#define VICRawIntr_AD0 0x40000
#define VICRawIntr_AD0_BIT 18
#define VICRawIntr_I2C1_MASK 0x80000
#define VICRawIntr_I2C1 0x80000
#define VICRawIntr_I2C1_BIT 19
#define VICRawIntr_BOD_MASK 0x100000
#define VICRawIntr_BOD 0x100000
#define VICRawIntr_BOD_BIT 20
#define VICRawIntr_Ethernet_MASK 0x200000
#define VICRawIntr_Ethernet 0x200000
#define VICRawIntr_Ethernet_BIT 21
#define VICRawIntr_USB_MASK 0x400000
#define VICRawIntr_USB 0x400000
#define VICRawIntr_USB_BIT 22
#define VICRawIntr_CAN1_2_MASK 0x800000
#define VICRawIntr_CAN1_2 0x800000
#define VICRawIntr_CAN1_2_BIT 23
#define VICRawIntr_SD_MMC_MASK 0x1000000
#define VICRawIntr_SD_MMC 0x1000000
#define VICRawIntr_SD_MMC_BIT 24
#define VICRawIntr_GPDMA_MASK 0x2000000
#define VICRawIntr_GPDMA 0x2000000
#define VICRawIntr_GPDMA_BIT 25
#define VICRawIntr_TIMER2_MASK 0x4000000
#define VICRawIntr_TIMER2 0x4000000
#define VICRawIntr_TIMER2_BIT 26
#define VICRawIntr_TIMER3_MASK 0x8000000
#define VICRawIntr_TIMER3 0x8000000
#define VICRawIntr_TIMER3_BIT 27
#define VICRawIntr_UART2_MASK 0x10000000
#define VICRawIntr_UART2 0x10000000
#define VICRawIntr_UART2_BIT 28
#define VICRawIntr_UART3_MASK 0x20000000
#define VICRawIntr_UART3 0x20000000
#define VICRawIntr_UART3_BIT 29
#define VICRawIntr_I2C2_MASK 0x40000000
#define VICRawIntr_I2C2 0x40000000
#define VICRawIntr_I2C2_BIT 30
#define VICRawIntr_I2S_MASK 0x80000000
#define VICRawIntr_I2S 0x80000000
#define VICRawIntr_I2S_BIT 31

#define VICIntSelect (*(volatile unsigned long *)0xFFFFF00C)
#define VICIntSelect_OFFSET 0xC
#define VICIntSelect_WDT_MASK 0x1
#define VICIntSelect_WDT 0x1
#define VICIntSelect_WDT_BIT 0
#define VICIntSelect_ARMCore0_MASK 0x4
#define VICIntSelect_ARMCore0 0x4
#define VICIntSelect_ARMCore0_BIT 2
#define VICIntSelect_ARMCore1_MASK 0x8
#define VICIntSelect_ARMCore1 0x8
#define VICIntSelect_ARMCore1_BIT 3
#define VICIntSelect_TIMER0_MASK 0x10
#define VICIntSelect_TIMER0 0x10
#define VICIntSelect_TIMER0_BIT 4
#define VICIntSelect_TIMER1_MASK 0x20
#define VICIntSelect_TIMER1 0x20
#define VICIntSelect_TIMER1_BIT 5
#define VICIntSelect_UART0_MASK 0x40
#define VICIntSelect_UART0 0x40
#define VICIntSelect_UART0_BIT 6
#define VICIntSelect_UART1_MASK 0x80
#define VICIntSelect_UART1 0x80
#define VICIntSelect_UART1_BIT 7
#define VICIntSelect_PWM1_MASK 0x100
#define VICIntSelect_PWM1 0x100
#define VICIntSelect_PWM1_BIT 8
#define VICIntSelect_I2C0_MASK 0x200
#define VICIntSelect_I2C0 0x200
#define VICIntSelect_I2C0_BIT 9
#define VICIntSelect_SPI_SSP0_MASK 0x400
#define VICIntSelect_SPI_SSP0 0x400
#define VICIntSelect_SPI_SSP0_BIT 10
#define VICIntSelect_SSP1_MASK 0x800
#define VICIntSelect_SSP1 0x800
#define VICIntSelect_SSP1_BIT 11
#define VICIntSelect_PLL_MASK 0x1000
#define VICIntSelect_PLL 0x1000
#define VICIntSelect_PLL_BIT 12
#define VICIntSelect_RTC_MASK 0x2000
#define VICIntSelect_RTC 0x2000
#define VICIntSelect_RTC_BIT 13
#define VICIntSelect_EINT0_MASK 0x4000
#define VICIntSelect_EINT0 0x4000
#define VICIntSelect_EINT0_BIT 14
#define VICIntSelect_EINT1_MASK 0x8000
#define VICIntSelect_EINT1 0x8000
#define VICIntSelect_EINT1_BIT 15
#define VICIntSelect_EINT2_MASK 0x10000
#define VICIntSelect_EINT2 0x10000
#define VICIntSelect_EINT2_BIT 16
#define VICIntSelect_EINT3_MASK 0x20000
#define VICIntSelect_EINT3 0x20000
#define VICIntSelect_EINT3_BIT 17
#define VICIntSelect_AD0_MASK 0x40000
#define VICIntSelect_AD0 0x40000
#define VICIntSelect_AD0_BIT 18
#define VICIntSelect_I2C1_MASK 0x80000
#define VICIntSelect_I2C1 0x80000
#define VICIntSelect_I2C1_BIT 19
#define VICIntSelect_BOD_MASK 0x100000
#define VICIntSelect_BOD 0x100000
#define VICIntSelect_BOD_BIT 20
#define VICIntSelect_Ethernet_MASK 0x200000
#define VICIntSelect_Ethernet 0x200000
#define VICIntSelect_Ethernet_BIT 21
#define VICIntSelect_USB_MASK 0x400000
#define VICIntSelect_USB 0x400000
#define VICIntSelect_USB_BIT 22
#define VICIntSelect_CAN1_2_MASK 0x800000
#define VICIntSelect_CAN1_2 0x800000
#define VICIntSelect_CAN1_2_BIT 23
#define VICIntSelect_SD_MMC_MASK 0x1000000
#define VICIntSelect_SD_MMC 0x1000000
#define VICIntSelect_SD_MMC_BIT 24
#define VICIntSelect_GPDMA_MASK 0x2000000
#define VICIntSelect_GPDMA 0x2000000
#define VICIntSelect_GPDMA_BIT 25
#define VICIntSelect_TIMER2_MASK 0x4000000
#define VICIntSelect_TIMER2 0x4000000
#define VICIntSelect_TIMER2_BIT 26
#define VICIntSelect_TIMER3_MASK 0x8000000
#define VICIntSelect_TIMER3 0x8000000
#define VICIntSelect_TIMER3_BIT 27
#define VICIntSelect_UART2_MASK 0x10000000
#define VICIntSelect_UART2 0x10000000
#define VICIntSelect_UART2_BIT 28
#define VICIntSelect_UART3_MASK 0x20000000
#define VICIntSelect_UART3 0x20000000
#define VICIntSelect_UART3_BIT 29
#define VICIntSelect_I2C2_MASK 0x40000000
#define VICIntSelect_I2C2 0x40000000
#define VICIntSelect_I2C2_BIT 30
#define VICIntSelect_I2S_MASK 0x80000000
#define VICIntSelect_I2S 0x80000000
#define VICIntSelect_I2S_BIT 31

#define VICIntEnable (*(volatile unsigned long *)0xFFFFF010)
#define VICIntEnable_OFFSET 0x10
#define VICIntEnable_WDT_MASK 0x1
#define VICIntEnable_WDT 0x1
#define VICIntEnable_WDT_BIT 0
#define VICIntEnable_ARMCore0_MASK 0x4
#define VICIntEnable_ARMCore0 0x4
#define VICIntEnable_ARMCore0_BIT 2
#define VICIntEnable_ARMCore1_MASK 0x8
#define VICIntEnable_ARMCore1 0x8
#define VICIntEnable_ARMCore1_BIT 3
#define VICIntEnable_TIMER0_MASK 0x10
#define VICIntEnable_TIMER0 0x10
#define VICIntEnable_TIMER0_BIT 4
#define VICIntEnable_TIMER1_MASK 0x20
#define VICIntEnable_TIMER1 0x20
#define VICIntEnable_TIMER1_BIT 5
#define VICIntEnable_UART0_MASK 0x40
#define VICIntEnable_UART0 0x40
#define VICIntEnable_UART0_BIT 6
#define VICIntEnable_UART1_MASK 0x80
#define VICIntEnable_UART1 0x80
#define VICIntEnable_UART1_BIT 7
#define VICIntEnable_PWM1_MASK 0x100
#define VICIntEnable_PWM1 0x100
#define VICIntEnable_PWM1_BIT 8
#define VICIntEnable_I2C0_MASK 0x200
#define VICIntEnable_I2C0 0x200
#define VICIntEnable_I2C0_BIT 9
#define VICIntEnable_SPI_SSP0_MASK 0x400
#define VICIntEnable_SPI_SSP0 0x400
#define VICIntEnable_SPI_SSP0_BIT 10
#define VICIntEnable_SSP1_MASK 0x800
#define VICIntEnable_SSP1 0x800
#define VICIntEnable_SSP1_BIT 11
#define VICIntEnable_PLL_MASK 0x1000
#define VICIntEnable_PLL 0x1000
#define VICIntEnable_PLL_BIT 12
#define VICIntEnable_RTC_MASK 0x2000
#define VICIntEnable_RTC 0x2000
#define VICIntEnable_RTC_BIT 13
#define VICIntEnable_EINT0_MASK 0x4000
#define VICIntEnable_EINT0 0x4000
#define VICIntEnable_EINT0_BIT 14
#define VICIntEnable_EINT1_MASK 0x8000
#define VICIntEnable_EINT1 0x8000
#define VICIntEnable_EINT1_BIT 15
#define VICIntEnable_EINT2_MASK 0x10000
#define VICIntEnable_EINT2 0x10000
#define VICIntEnable_EINT2_BIT 16
#define VICIntEnable_EINT3_MASK 0x20000
#define VICIntEnable_EINT3 0x20000
#define VICIntEnable_EINT3_BIT 17
#define VICIntEnable_AD0_MASK 0x40000
#define VICIntEnable_AD0 0x40000
#define VICIntEnable_AD0_BIT 18
#define VICIntEnable_I2C1_MASK 0x80000
#define VICIntEnable_I2C1 0x80000
#define VICIntEnable_I2C1_BIT 19
#define VICIntEnable_BOD_MASK 0x100000
#define VICIntEnable_BOD 0x100000
#define VICIntEnable_BOD_BIT 20
#define VICIntEnable_Ethernet_MASK 0x200000
#define VICIntEnable_Ethernet 0x200000
#define VICIntEnable_Ethernet_BIT 21
#define VICIntEnable_USB_MASK 0x400000
#define VICIntEnable_USB 0x400000
#define VICIntEnable_USB_BIT 22
#define VICIntEnable_CAN1_2_MASK 0x800000
#define VICIntEnable_CAN1_2 0x800000
#define VICIntEnable_CAN1_2_BIT 23
#define VICIntEnable_SD_MMC_MASK 0x1000000
#define VICIntEnable_SD_MMC 0x1000000
#define VICIntEnable_SD_MMC_BIT 24
#define VICIntEnable_GPDMA_MASK 0x2000000
#define VICIntEnable_GPDMA 0x2000000
#define VICIntEnable_GPDMA_BIT 25
#define VICIntEnable_TIMER2_MASK 0x4000000
#define VICIntEnable_TIMER2 0x4000000
#define VICIntEnable_TIMER2_BIT 26
#define VICIntEnable_TIMER3_MASK 0x8000000
#define VICIntEnable_TIMER3 0x8000000
#define VICIntEnable_TIMER3_BIT 27
#define VICIntEnable_UART2_MASK 0x10000000
#define VICIntEnable_UART2 0x10000000
#define VICIntEnable_UART2_BIT 28
#define VICIntEnable_UART3_MASK 0x20000000
#define VICIntEnable_UART3 0x20000000
#define VICIntEnable_UART3_BIT 29
#define VICIntEnable_I2C2_MASK 0x40000000
#define VICIntEnable_I2C2 0x40000000
#define VICIntEnable_I2C2_BIT 30
#define VICIntEnable_I2S_MASK 0x80000000
#define VICIntEnable_I2S 0x80000000
#define VICIntEnable_I2S_BIT 31

