bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define VICIntEnClr (*(volatile unsigned long *)0xFFFFF014)
#define VICIntEnClr_OFFSET 0x14
#define VICIntEnClr_WDT_MASK 0x1
#define VICIntEnClr_WDT 0x1
#define VICIntEnClr_WDT_BIT 0
#define VICIntEnClr_ARMCore0_MASK 0x4
#define VICIntEnClr_ARMCore0 0x4
#define VICIntEnClr_ARMCore0_BIT 2
#define VICIntEnClr_ARMCore1_MASK 0x8
#define VICIntEnClr_ARMCore1 0x8
#define VICIntEnClr_ARMCore1_BIT 3
#define VICIntEnClr_TIMER0_MASK 0x10
#define VICIntEnClr_TIMER0 0x10
#define VICIntEnClr_TIMER0_BIT 4
#define VICIntEnClr_TIMER1_MASK 0x20
#define VICIntEnClr_TIMER1 0x20
#define VICIntEnClr_TIMER1_BIT 5
#define VICIntEnClr_UART0_MASK 0x40
#define VICIntEnClr_UART0 0x40
#define VICIntEnClr_UART0_BIT 6
#define VICIntEnClr_UART1_MASK 0x80
#define VICIntEnClr_UART1 0x80
#define VICIntEnClr_UART1_BIT 7
#define VICIntEnClr_PWM1_MASK 0x100
#define VICIntEnClr_PWM1 0x100
#define VICIntEnClr_PWM1_BIT 8
#define VICIntEnClr_I2C0_MASK 0x200
#define VICIntEnClr_I2C0 0x200
#define VICIntEnClr_I2C0_BIT 9
#define VICIntEnClr_SPI_SSP0_MASK 0x400
#define VICIntEnClr_SPI_SSP0 0x400
#define VICIntEnClr_SPI_SSP0_BIT 10
#define VICIntEnClr_SSP1_MASK 0x800
#define VICIntEnClr_SSP1 0x800
#define VICIntEnClr_SSP1_BIT 11
#define VICIntEnClr_PLL_MASK 0x1000
#define VICIntEnClr_PLL 0x1000
#define VICIntEnClr_PLL_BIT 12
#define VICIntEnClr_RTC_MASK 0x2000
#define VICIntEnClr_RTC 0x2000
#define VICIntEnClr_RTC_BIT 13
#define VICIntEnClr_EINT0_MASK 0x4000
#define VICIntEnClr_EINT0 0x4000
#define VICIntEnClr_EINT0_BIT 14
#define VICIntEnClr_EINT1_MASK 0x8000
#define VICIntEnClr_EINT1 0x8000
#define VICIntEnClr_EINT1_BIT 15
#define VICIntEnClr_EINT2_MASK 0x10000
#define VICIntEnClr_EINT2 0x10000
#define VICIntEnClr_EINT2_BIT 16
#define VICIntEnClr_EINT3_MASK 0x20000
#define VICIntEnClr_EINT3 0x20000
#define VICIntEnClr_EINT3_BIT 17
#define VICIntEnClr_AD0_MASK 0x40000
#define VICIntEnClr_AD0 0x40000
#define VICIntEnClr_AD0_BIT 18
#define VICIntEnClr_I2C1_MASK 0x80000
#define VICIntEnClr_I2C1 0x80000
#define VICIntEnClr_I2C1_BIT 19
#define VICIntEnClr_BOD_MASK 0x100000
#define VICIntEnClr_BOD 0x100000
#define VICIntEnClr_BOD_BIT 20
#define VICIntEnClr_Ethernet_MASK 0x200000
#define VICIntEnClr_Ethernet 0x200000
#define VICIntEnClr_Ethernet_BIT 21
#define VICIntEnClr_USB_MASK 0x400000
#define VICIntEnClr_USB 0x400000
#define VICIntEnClr_USB_BIT 22
#define VICIntEnClr_CAN1_2_MASK 0x800000
#define VICIntEnClr_CAN1_2 0x800000
#define VICIntEnClr_CAN1_2_BIT 23
#define VICIntEnClr_SD_MMC_MASK 0x1000000
#define VICIntEnClr_SD_MMC 0x1000000
#define VICIntEnClr_SD_MMC_BIT 24
#define VICIntEnClr_GPDMA_MASK 0x2000000
#define VICIntEnClr_GPDMA 0x2000000
#define VICIntEnClr_GPDMA_BIT 25
#define VICIntEnClr_TIMER2_MASK 0x4000000
#define VICIntEnClr_TIMER2 0x4000000
#define VICIntEnClr_TIMER2_BIT 26
#define VICIntEnClr_TIMER3_MASK 0x8000000
#define VICIntEnClr_TIMER3 0x8000000
#define VICIntEnClr_TIMER3_BIT 27
#define VICIntEnClr_UART2_MASK 0x10000000
#define VICIntEnClr_UART2 0x10000000
#define VICIntEnClr_UART2_BIT 28
#define VICIntEnClr_UART3_MASK 0x20000000
#define VICIntEnClr_UART3 0x20000000
#define VICIntEnClr_UART3_BIT 29
#define VICIntEnClr_I2C2_MASK 0x40000000
#define VICIntEnClr_I2C2 0x40000000
#define VICIntEnClr_I2C2_BIT 30
#define VICIntEnClr_I2S_MASK 0x80000000
#define VICIntEnClr_I2S 0x80000000
#define VICIntEnClr_I2S_BIT 31

#define VICSoftInt (*(volatile unsigned long *)0xFFFFF018)
#define VICSoftInt_OFFSET 0x18
#define VICSoftInt_WDT_MASK 0x1
#define VICSoftInt_WDT 0x1
#define VICSoftInt_WDT_BIT 0
#define VICSoftInt_ARMCore0_MASK 0x4
#define VICSoftInt_ARMCore0 0x4
#define VICSoftInt_ARMCore0_BIT 2
#define VICSoftInt_ARMCore1_MASK 0x8
#define VICSoftInt_ARMCore1 0x8
#define VICSoftInt_ARMCore1_BIT 3
#define VICSoftInt_TIMER0_MASK 0x10
#define VICSoftInt_TIMER0 0x10
#define VICSoftInt_TIMER0_BIT 4
#define VICSoftInt_TIMER1_MASK 0x20
#define VICSoftInt_TIMER1 0x20
#define VICSoftInt_TIMER1_BIT 5
#define VICSoftInt_UART0_MASK 0x40
#define VICSoftInt_UART0 0x40
#define VICSoftInt_UART0_BIT 6
#define VICSoftInt_UART1_MASK 0x80
#define VICSoftInt_UART1 0x80
#define VICSoftInt_UART1_BIT 7
#define VICSoftInt_PWM1_MASK 0x100
#define VICSoftInt_PWM1 0x100
#define VICSoftInt_PWM1_BIT 8
#define VICSoftInt_I2C0_MASK 0x200
#define VICSoftInt_I2C0 0x200
#define VICSoftInt_I2C0_BIT 9
#define VICSoftInt_SPI_SSP0_MASK 0x400
#define VICSoftInt_SPI_SSP0 0x400
#define VICSoftInt_SPI_SSP0_BIT 10
#define VICSoftInt_SSP1_MASK 0x800
#define VICSoftInt_SSP1 0x800
#define VICSoftInt_SSP1_BIT 11
#define VICSoftInt_PLL_MASK 0x1000
#define VICSoftInt_PLL 0x1000
#define VICSoftInt_PLL_BIT 12
#define VICSoftInt_RTC_MASK 0x2000
#define VICSoftInt_RTC 0x2000
#define VICSoftInt_RTC_BIT 13
#define VICSoftInt_EINT0_MASK 0x4000
#define VICSoftInt_EINT0 0x4000
#define VICSoftInt_EINT0_BIT 14
#define VICSoftInt_EINT1_MASK 0x8000
#define VICSoftInt_EINT1 0x8000
#define VICSoftInt_EINT1_BIT 15
#define VICSoftInt_EINT2_MASK 0x10000
#define VICSoftInt_EINT2 0x10000
#define VICSoftInt_EINT2_BIT 16
#define VICSoftInt_EINT3_MASK 0x20000
#define VICSoftInt_EINT3 0x20000
#define VICSoftInt_EINT3_BIT 17
#define VICSoftInt_AD0_MASK 0x40000
#define VICSoftInt_AD0 0x40000
#define VICSoftInt_AD0_BIT 18
#define VICSoftInt_I2C1_MASK 0x80000
#define VICSoftInt_I2C1 0x80000
#define VICSoftInt_I2C1_BIT 19
#define VICSoftInt_BOD_MASK 0x100000
#define VICSoftInt_BOD 0x100000
#define VICSoftInt_BOD_BIT 20
#define VICSoftInt_Ethernet_MASK 0x200000
#define VICSoftInt_Ethernet 0x200000
#define VICSoftInt_Ethernet_BIT 21
#define VICSoftInt_USB_MASK 0x400000
#define VICSoftInt_USB 0x400000
#define VICSoftInt_USB_BIT 22
#define VICSoftInt_CAN1_2_MASK 0x800000
#define VICSoftInt_CAN1_2 0x800000
#define VICSoftInt_CAN1_2_BIT 23
#define VICSoftInt_SD_MMC_MASK 0x1000000
#define VICSoftInt_SD_MMC 0x1000000
#define VICSoftInt_SD_MMC_BIT 24
#define VICSoftInt_GPDMA_MASK 0x2000000
#define VICSoftInt_GPDMA 0x2000000
#define VICSoftInt_GPDMA_BIT 25
#define VICSoftInt_TIMER2_MASK 0x4000000
#define VICSoftInt_TIMER2 0x4000000
#define VICSoftInt_TIMER2_BIT 26
#define VICSoftInt_TIMER3_MASK 0x8000000
#define VICSoftInt_TIMER3 0x8000000
#define VICSoftInt_TIMER3_BIT 27
#define VICSoftInt_UART2_MASK 0x10000000
#define VICSoftInt_UART2 0x10000000
#define VICSoftInt_UART2_BIT 28
#define VICSoftInt_UART3_MASK 0x20000000
#define VICSoftInt_UART3 0x20000000
#define VICSoftInt_UART3_BIT 29
#define VICSoftInt_I2C2_MASK 0x40000000
#define VICSoftInt_I2C2 0x40000000
#define VICSoftInt_I2C2_BIT 30
#define VICSoftInt_I2S_MASK 0x80000000
#define VICSoftInt_I2S 0x80000000
#define VICSoftInt_I2S_BIT 31

#define VICSoftIntClear (*(volatile unsigned long *)0xFFFFF01C)
#define VICSoftIntClear_OFFSET 0x1C
#define VICSoftIntClear_WDT_MASK 0x1
#define VICSoftIntClear_WDT 0x1
#define VICSoftIntClear_WDT_BIT 0
#define VICSoftIntClear_ARMCore0_MASK 0x4
#define VICSoftIntClear_ARMCore0 0x4
#define VICSoftIntClear_ARMCore0_BIT 2
#define VICSoftIntClear_ARMCore1_MASK 0x8
#define VICSoftIntClear_ARMCore1 0x8
#define VICSoftIntClear_ARMCore1_BIT 3
#define VICSoftIntClear_TIMER0_MASK 0x10
#define VICSoftIntClear_TIMER0 0x10
#define VICSoftIntClear_TIMER0_BIT 4
#define VICSoftIntClear_TIMER1_MASK 0x20
#define VICSoftIntClear_TIMER1 0x20
#define VICSoftIntClear_TIMER1_BIT 5
#define VICSoftIntClear_UART0_MASK 0x40
#define VICSoftIntClear_UART0 0x40
#define VICSoftIntClear_UART0_BIT 6
#define VICSoftIntClear_UART1_MASK 0x80
#define VICSoftIntClear_UART1 0x80
#define VICSoftIntClear_UART1_BIT 7
#define VICSoftIntClear_PWM1_MASK 0x100
#define VICSoftIntClear_PWM1 0x100
#define VICSoftIntClear_PWM1_BIT 8
#define VICSoftIntClear_I2C0_MASK 0x200
#define VICSoftIntClear_I2C0 0x200
#define VICSoftIntClear_I2C0_BIT 9
#define VICSoftIntClear_SPI_SSP0_MASK 0x400
#define VICSoftIntClear_SPI_SSP0 0x400
#define VICSoftIntClear_SPI_SSP0_BIT 10
#define VICSoftIntClear_SSP1_MASK 0x800
#define VICSoftIntClear_SSP1 0x800
#define VICSoftIntClear_SSP1_BIT 11
#define VICSoftIntClear_PLL_MASK 0x1000
#define VICSoftIntClear_PLL 0x1000
#define VICSoftIntClear_PLL_BIT 12
#define VICSoftIntClear_RTC_MASK 0x2000
#define VICSoftIntClear_RTC 0x2000
#define VICSoftIntClear_RTC_BIT 13
#define VICSoftIntClear_EINT0_MASK 0x4000
#define VICSoftIntClear_EINT0 0x4000
#define VICSoftIntClear_EINT0_BIT 14
#define VICSoftIntClear_EINT1_MASK 0x8000
#define VICSoftIntClear_EINT1 0x8000
#define VICSoftIntClear_EINT1_BIT 15
#define VICSoftIntClear_EINT2_MASK 0x10000
#define VICSoftIntClear_EINT2 0x10000
#define VICSoftIntClear_EINT2_BIT 16
#define VICSoftIntClear_EINT3_MASK 0x20000
#define VICSoftIntClear_EINT3 0x20000
#define VICSoftIntClear_EINT3_BIT 17
#define VICSoftIntClear_AD0_MASK 0x40000
#define VICSoftIntClear_AD0 0x40000
#define VICSoftIntClear_AD0_BIT 18
#define VICSoftIntClear_I2C1_MASK 0x80000
#define VICSoftIntClear_I2C1 0x80000
#define VICSoftIntClear_I2C1_BIT 19
#define VICSoftIntClear_BOD_MASK 0x100000
#define VICSoftIntClear_BOD 0x100000
#define VICSoftIntClear_BOD_BIT 20
#define VICSoftIntClear_Ethernet_MASK 0x200000
#define VICSoftIntClear_Ethernet 0x200000
#define VICSoftIntClear_Ethernet_BIT 21
#define VICSoftIntClear_USB_MASK 0x400000
#define VICSoftIntClear_USB 0x400000
#define VICSoftIntClear_USB_BIT 22
#define VICSoftIntClear_CAN1_2_MASK 0x800000
#define VICSoftIntClear_CAN1_2 0x800000
#define VICSoftIntClear_CAN1_2_BIT 23
#define VICSoftIntClear_SD_MMC_MASK 0x1000000
#define VICSoftIntClear_SD_MMC 0x1000000
#define VICSoftIntClear_SD_MMC_BIT 24
#define VICSoftIntClear_GPDMA_MASK 0x2000000
#define VICSoftIntClear_GPDMA 0x2000000
#define VICSoftIntClear_GPDMA_BIT 25
#define VICSoftIntClear_TIMER2_MASK 0x4000000
#define VICSoftIntClear_TIMER2 0x4000000
#define VICSoftIntClear_TIMER2_BIT 26
#define VICSoftIntClear_TIMER3_MASK 0x8000000
#define VICSoftIntClear_TIMER3 0x8000000
#define VICSoftIntClear_TIMER3_BIT 27
#define VICSoftIntClear_UART2_MASK 0x10000000
#define VICSoftIntClear_UART2 0x10000000
#define VICSoftIntClear_UART2_BIT 28
#define VICSoftIntClear_UART3_MASK 0x20000000
#define VICSoftIntClear_UART3 0x20000000
#define VICSoftIntClear_UART3_BIT 29
#define VICSoftIntClear_I2C2_MASK 0x40000000
#define VICSoftIntClear_I2C2 0x40000000
#define VICSoftIntClear_I2C2_BIT 30
#define VICSoftIntClear_I2S_MASK 0x80000000
#define VICSoftIntClear_I2S 0x80000000
#define VICSoftIntClear_I2S_BIT 31

