bengelbert/ifsc/tcc/embedded/targets/LPC2368.h
#define VICProtection (*(volatile unsigned long *)0xFFFFF020)
#define VICProtection_OFFSET 0x20
#define VICProtection_VIC_access_MASK 0x1
#define VICProtection_VIC_access 0x1
#define VICProtection_VIC_access_BIT 0

#define VICSWPriorityMask (*(volatile unsigned long *)0xFFFFF024)
#define VICSWPriorityMask_OFFSET 0x24

#define VICVectAddr0 (*(volatile unsigned long *)0xFFFFF100)
#define VICVectAddr0_OFFSET 0x100

#define VICVectAddr1 (*(volatile unsigned long *)0xFFFFF104)
#define VICVectAddr1_OFFSET 0x104

#define VICVectAddr2 (*(volatile unsigned long *)0xFFFFF108)
#define VICVectAddr2_OFFSET 0x108

#define VICVectAddr3 (*(volatile unsigned long *)0xFFFFF10C)
#define VICVectAddr3_OFFSET 0x10C

#define VICVectAddr4 (*(volatile unsigned long *)0xFFFFF110)
#define VICVectAddr4_OFFSET 0x110

#define VICVectAddr5 (*(volatile unsigned long *)0xFFFFF114)
#define VICVectAddr5_OFFSET 0x114

#define VICVectAddr6 (*(volatile unsigned long *)0xFFFFF118)
#define VICVectAddr6_OFFSET 0x118

#define VICVectAddr7 (*(volatile unsigned long *)0xFFFFF11C)
#define VICVectAddr7_OFFSET 0x11C

#define VICVectAddr8 (*(volatile unsigned long *)0xFFFFF120)
#define VICVectAddr8_OFFSET 0x120

#define VICVectAddr9 (*(volatile unsigned long *)0xFFFFF124)
#define VICVectAddr9_OFFSET 0x124

#define VICVectAddr10 (*(volatile unsigned long *)0xFFFFF128)
#define VICVectAddr10_OFFSET 0x128

#define VICVectAddr11 (*(volatile unsigned long *)0xFFFFF12C)
#define VICVectAddr11_OFFSET 0x12C

#define VICVectAddr12 (*(volatile unsigned long *)0xFFFFF130)
#define VICVectAddr12_OFFSET 0x130

#define VICVectAddr13 (*(volatile unsigned long *)0xFFFFF134)
#define VICVectAddr13_OFFSET 0x134

#define VICVectAddr14 (*(volatile unsigned long *)0xFFFFF138)
#define VICVectAddr14_OFFSET 0x138

#define VICVectAddr15 (*(volatile unsigned long *)0xFFFFF13C)
#define VICVectAddr15_OFFSET 0x13C

#define VICVectAddr16 (*(volatile unsigned long *)0xFFFFF140)
#define VICVectAddr16_OFFSET 0x140

#define VICVectAddr17 (*(volatile unsigned long *)0xFFFFF144)
#define VICVectAddr17_OFFSET 0x144

#define VICVectAddr18 (*(volatile unsigned long *)0xFFFFF148)
#define VICVectAddr18_OFFSET 0x148

#define VICVectAddr19 (*(volatile unsigned long *)0xFFFFF14C)
#define VICVectAddr19_OFFSET 0x14C

#define VICVectAddr20 (*(volatile unsigned long *)0xFFFFF150)
#define VICVectAddr20_OFFSET 0x150

#define VICVectAddr21 (*(volatile unsigned long *)0xFFFFF154)
#define VICVectAddr21_OFFSET 0x154

#define VICVectAddr22 (*(volatile unsigned long *)0xFFFFF158)
#define VICVectAddr22_OFFSET 0x158

#define VICVectAddr23 (*(volatile unsigned long *)0xFFFFF15C)
#define VICVectAddr23_OFFSET 0x15C

#define VICVectAddr24 (*(volatile unsigned long *)0xFFFFF160)
#define VICVectAddr24_OFFSET 0x160

#define VICVectAddr25 (*(volatile unsigned long *)0xFFFFF164)
#define VICVectAddr25_OFFSET 0x164

#define VICVectAddr26 (*(volatile unsigned long *)0xFFFFF168)
#define VICVectAddr26_OFFSET 0x168

#define VICVectAddr27 (*(volatile unsigned long *)0xFFFFF16C)
#define VICVectAddr27_OFFSET 0x16C

#define VICVectAddr28 (*(volatile unsigned long *)0xFFFFF170)
#define VICVectAddr28_OFFSET 0x170

#define VICVectAddr29 (*(volatile unsigned long *)0xFFFFF174)
#define VICVectAddr29_OFFSET 0x174

#define VICVectAddr30 (*(volatile unsigned long *)0xFFFFF178)
#define VICVectAddr30_OFFSET 0x178

#define VICVectAddr31 (*(volatile unsigned long *)0xFFFFF17C)
#define VICVectAddr31_OFFSET 0x17C

#define VICVectPriority0 (*(volatile unsigned long *)0xFFFFF200)
#define VICVectPriority0_OFFSET 0x200

#define VICVectPriority1 (*(volatile unsigned long *)0xFFFFF204)
#define VICVectPriority1_OFFSET 0x204

#define VICVectPriority2 (*(volatile unsigned long *)0xFFFFF208)
#define VICVectPriority2_OFFSET 0x208

#define VICVectPriority3 (*(volatile unsigned long *)0xFFFFF20C)
#define VICVectPriority3_OFFSET 0x20C

#define VICVectPriority4 (*(volatile unsigned long *)0xFFFFF210)
#define VICVectPriority4_OFFSET 0x210

#define VICVectPriority5 (*(volatile unsigned long *)0xFFFFF214)
#define VICVectPriority5_OFFSET 0x214

#define VICVectPriority6 (*(volatile unsigned long *)0xFFFFF218)
#define VICVectPriority6_OFFSET 0x218

#define VICVectPriority7 (*(volatile unsigned long *)0xFFFFF21C)
#define VICVectPriority7_OFFSET 0x21C

#define VICVectPriority8 (*(volatile unsigned long *)0xFFFFF220)
#define VICVectPriority8_OFFSET 0x220

#define VICVectPriority9 (*(volatile unsigned long *)0xFFFFF224)
#define VICVectPriority9_OFFSET 0x224

#define VICVectPriority10 (*(volatile unsigned long *)0xFFFFF228)
#define VICVectPriority10_OFFSET 0x228

#define VICVectPriority11 (*(volatile unsigned long *)0xFFFFF22C)
#define VICVectPriority11_OFFSET 0x22C

#define VICVectPriority12 (*(volatile unsigned long *)0xFFFFF230)
#define VICVectPriority12_OFFSET 0x230

#define VICVectPriority13 (*(volatile unsigned long *)0xFFFFF234)
#define VICVectPriority13_OFFSET 0x234

#define VICVectPriority14 (*(volatile unsigned long *)0xFFFFF238)
#define VICVectPriority14_OFFSET 0x238

#define VICVectPriority15 (*(volatile unsigned long *)0xFFFFF23C)
#define VICVectPriority15_OFFSET 0x23C

#define VICVectPriority16 (*(volatile unsigned long *)0xFFFFF240)
#define VICVectPriority16_OFFSET 0x240

#define VICVectPriority17 (*(volatile unsigned long *)0xFFFFF244)
#define VICVectPriority17_OFFSET 0x244

#define VICVectPriority18 (*(volatile unsigned long *)0xFFFFF248)
#define VICVectPriority18_OFFSET 0x248

#define VICVectPriority19 (*(volatile unsigned long *)0xFFFFF24C)
#define VICVectPriority19_OFFSET 0x24C

#define VICVectPriority20 (*(volatile unsigned long *)0xFFFFF250)
#define VICVectPriority20_OFFSET 0x250

#define VICVectPriority21 (*(volatile unsigned long *)0xFFFFF254)
#define VICVectPriority21_OFFSET 0x254

#define VICVectPriority22 (*(volatile unsigned long *)0xFFFFF258)
#define VICVectPriority22_OFFSET 0x258

#define VICVectPriority23 (*(volatile unsigned long *)0xFFFFF25C)
#define VICVectPriority23_OFFSET 0x25C

#define VICVectPriority24 (*(volatile unsigned long *)0xFFFFF260)
#define VICVectPriority24_OFFSET 0x260

#define VICVectPriority25 (*(volatile unsigned long *)0xFFFFF264)
#define VICVectPriority25_OFFSET 0x264

#define VICVectPriority26 (*(volatile unsigned long *)0xFFFFF268)
#define VICVectPriority26_OFFSET 0x268

#define VICVectPriority27 (*(volatile unsigned long *)0xFFFFF26C)
#define VICVectPriority27_OFFSET 0x26C

#define VICVectPriority28 (*(volatile unsigned long *)0xFFFFF270)
#define VICVectPriority28_OFFSET 0x270

#define VICVectPriority29 (*(volatile unsigned long *)0xFFFFF274)
#define VICVectPriority29_OFFSET 0x274

#define VICVectPriority30 (*(volatile unsigned long *)0xFFFFF278)
#define VICVectPriority30_OFFSET 0x278

#define VICVectPriority31 (*(volatile unsigned long *)0xFFFFF27C)
#define VICVectPriority31_OFFSET 0x27C

#define VICAddress (*(volatile unsigned long *)0xFFFFFF00)
#define VICAddress_OFFSET 0xF00


#endif
